
# State **`s3://infrahouse-aws-control-289256138624/terraform.tfstate`**
## Affected resources counts

|  Success  |   🟢 Add |    Change |    Destroy |
|:---------:|--------:|----------:|-----------:|
|     ✅     |       7 |         0 |          0 |
## Affected resources by action

|  Action  | Resources                                                                                                          |
|:--------:|:-------------------------------------------------------------------------------------------------------------------|
|    🟢     | `module.buckets["infrahouse-aws-control-493370826424"].aws_s3_bucket.state-bucket`                                 |
|    🟢     | `module.buckets["infrahouse-aws-control-493370826424"].aws_s3_bucket_public_access_block.public_access`            |
|    🟢     | `module.buckets["infrahouse-aws-control-493370826424"].aws_s3_bucket_server_side_encryption_configuration.default` |
|    🟢     | `module.buckets["infrahouse-aws-control-493370826424"].aws_s3_bucket_versioning.enabled`                           |
|    🟢     | `module.ih-tf-aws-control-493370826424-state-manager.aws_iam_policy.permissions`                                   |
|    🟢     | `module.ih-tf-aws-control-493370826424-state-manager.aws_iam_role.state-manager`                                   |
|    🟢     | `module.ih-tf-aws-control-493370826424-state-manager.aws_iam_role_policy_attachment.state-manager`                 |
|    🟢     | `module.buckets["infrahouse-aws-control-303467602807"].aws_s3_bucket.state-bucket:`                                |
<details>
<summary>STDOUT</summary>

```[command]/home/runner/work/_temp/23e0727d-360f-4459-8fa0-c4e5376fe327/terraform-bin plan -no-color --out=tf.plan
module.buckets["infrahouse-aws-control-303467602807"].aws_s3_bucket.state-bucket: Refreshing state... [id=infrahouse-aws-control-303467602807]
aws_dynamodb_table.terraform_locks: Refreshing state... [id=infrahouse-terraform-state-locks]
module.ih-tf-aws-control-990466748045-state-manager.data.aws_iam_policy_document.assume: Reading...
module.buckets["infrahouse-aws-control-990466748045"].aws_s3_bucket.state-bucket: Refreshing state... [id=infrahouse-aws-control-990466748045]
module.ih-tf-aws-control-303467602807-state-manager.data.aws_iam_policy_document.assume: Reading...
module.ih-tf-aws-control-289256138624-admin.data.aws_iam_policy_document.github-permissions: Reading...
module.github-connector.aws_iam_openid_connect_provider.github: Refreshing state... [id=arn:aws:iam::289256138624:oidc-provider/token.actions.githubusercontent.com]
data.aws_iam_policy.administrator-access: Reading...
module.ih-tf-aws-control-990466748045-state-manager.data.aws_iam_policy_document.assume: Read complete after 0s [id=2670099516]
module.ih-tf-aws-control-289256138624-admin.data.aws_iam_policy_document.github-permissions: Read complete after 0s [id=1603774485]
module.ih-tf-aws-control-303467602807-state-manager.data.aws_iam_policy_document.assume: Read complete after 0s [id=4163919237]
module.buckets["infrahouse-github-state"].aws_s3_bucket.state-bucket: Refreshing state... [id=infrahouse-github-state]
module.ih-tf-aws-control-493370826424-state-manager.data.aws_iam_policy_document.assume: Reading...
module.buckets["infrahouse-aws-control-289256138624"].aws_s3_bucket.state-bucket: Refreshing state... [id=infrahouse-aws-control-289256138624]
module.ih-tf-aws-control-493370826424-state-manager.data.aws_iam_policy_document.assume: Read complete after 0s [id=3002917113]
module.ih-tf-aws-control-289256138624-admin.data.aws_iam_policy.administrator-access: Reading...
module.ih-tf-aws-control-990466748045-state-manager.aws_iam_role.state-manager: Refreshing state... [id=ih-tf-aws-control-state-manager]
module.ih-tf-aws-control-303467602807-state-manager.aws_iam_role.state-manager: Refreshing state... [id=ih-tf-aws-control-303467602807-state-manager]
data.aws_iam_policy_document.ih-tf-terraform-control-assume: Reading...
data.aws_iam_policy_document.ih-tf-terraform-control-assume: Read complete after 0s [id=1154989936]
data.aws_iam_policy_document.ih-tf-aws-control-assume: Reading...
data.aws_iam_policy_document.ih-tf-aws-control-assume: Read complete after 0s [id=1268673852]
data.aws_iam_policy_document.ih-tf-github-control-assume: Reading...
data.aws_iam_policy_document.ih-tf-github-control-assume: Read complete after 0s [id=1521129737]
module.ih-tf-aws-control-289256138624-state-manager.data.aws_iam_policy_document.permissions: Reading...
module.ih-tf-aws-control-289256138624-state-manager.data.aws_iam_policy_document.permissions: Read complete after 0s [id=1875560935]
module.ih-tf-aws-control-493370826424-state-manager.data.aws_iam_policy_document.permissions: Reading...
module.ih-tf-aws-control-493370826424-state-manager.data.aws_iam_policy_document.permissions: Read complete after 0s [id=3986654380]
module.ih-tf-aws-control-990466748045-state-manager.data.aws_iam_policy_document.permissions: Reading...
module.ih-tf-aws-control-990466748045-state-manager.data.aws_iam_policy_document.permissions: Read complete after 0s [id=2787982525]
module.ih-tf-aws-control-303467602807-state-manager.data.aws_iam_policy_document.permissions: Reading...
module.ih-tf-aws-control-303467602807-state-manager.data.aws_iam_policy_document.permissions: Read complete after 0s [id=3056019456]
aws_iam_role.ih-tf-terraform-control: Refreshing state... [id=ih-tf-terraform-control]
aws_iam_role.ih-tf-aws-control: Refreshing state... [id=ih-tf-aws-control]
aws_iam_role.ih-tf-github-control: Refreshing state... [id=ih-tf-github-control]
module.ih-tf-aws-control-289256138624-state-manager.aws_iam_policy.permissions: Refreshing state... [id=arn:aws:iam::289256138624:policy/ih-tf-aws-control-289256138624-state-manager20230702010953834400000001]
module.ih-tf-aws-control-990466748045-state-manager.aws_iam_policy.permissions: Refreshing state... [id=arn:aws:iam::289256138624:policy/ih-tf-aws-control-state-manager20230703025728648400000001]
module.ih-tf-aws-control-303467602807-state-manager.aws_iam_policy.permissions: Refreshing state... [id=arn:aws:iam::289256138624:policy/ih-tf-aws-control-303467602807-state-manager20230702155036825500000001]
module.buckets["infrahouse-github-state"].aws_s3_bucket_public_access_block.public_access: Refreshing state... [id=infrahouse-github-state]
module.buckets["infrahouse-aws-control-303467602807"].aws_s3_bucket_public_access_block.public_access: Refreshing state... [id=infrahouse-aws-control-303467602807]
module.buckets["infrahouse-aws-control-289256138624"].aws_s3_bucket_public_access_block.public_access: Refreshing state... [id=infrahouse-aws-control-289256138624]
module.buckets["infrahouse-aws-control-990466748045"].aws_s3_bucket_public_access_block.public_access: Refreshing state... [id=infrahouse-aws-control-990466748045]
module.buckets["infrahouse-github-state"].aws_s3_bucket_server_side_encryption_configuration.default: Refreshing state... [id=infrahouse-github-state]
module.ih-tf-aws-control-289256138624-admin.data.aws_iam_policy_document.github-assume: Reading...
module.ih-tf-aws-control-289256138624-admin.data.aws_iam_policy_document.github-assume: Read complete after 0s [id=2022835186]
module.buckets["infrahouse-github-state"].aws_s3_bucket_versioning.enabled: Refreshing state... [id=infrahouse-github-state]
module.buckets["infrahouse-aws-control-303467602807"].aws_s3_bucket_server_side_encryption_configuration.default: Refreshing state... [id=infrahouse-aws-control-303467602807]
module.buckets["infrahouse-aws-control-289256138624"].aws_s3_bucket_server_side_encryption_configuration.default: Refreshing state... [id=infrahouse-aws-control-289256138624]
module.buckets["infrahouse-aws-control-990466748045"].aws_s3_bucket_server_side_encryption_configuration.default: Refreshing state... [id=infrahouse-aws-control-990466748045]
module.buckets["infrahouse-aws-control-289256138624"].aws_s3_bucket_versioning.enabled: Refreshing state... [id=infrahouse-aws-control-289256138624]
module.buckets["infrahouse-aws-control-303467602807"].aws_s3_bucket_versioning.enabled: Refreshing state... [id=infrahouse-aws-control-303467602807]
module.buckets["infrahouse-aws-control-990466748045"].aws_s3_bucket_versioning.enabled: Refreshing state... [id=infrahouse-aws-control-990466748045]
module.ih-tf-aws-control-289256138624-admin.aws_iam_role.github: Refreshing state... [id=ih-tf-aws-control-289256138624-github]
module.ih-tf-aws-control-990466748045-state-manager.aws_iam_role_policy_attachment.state-manager: Refreshing state... [id=ih-tf-aws-control-state-manager-20230703025729520400000002]
module.ih-tf-aws-control-303467602807-state-manager.aws_iam_role_policy_attachment.state-manager: Refreshing state... [id=ih-tf-aws-control-303467602807-state-manager-20230702155037054300000002]
module.ih-tf-aws-control-289256138624-state-manager.data.aws_iam_policy_document.assume: Reading...
module.ih-tf-aws-control-289256138624-admin.data.aws_iam_policy_document.admin-assume: Reading...
module.ih-tf-aws-control-289256138624-state-manager.data.aws_iam_policy_document.assume: Read complete after 0s [id=2704423537]
module.ih-tf-aws-control-289256138624-admin.data.aws_iam_policy_document.admin-assume: Read complete after 0s [id=413646908]
module.ih-tf-aws-control-289256138624-state-manager.aws_iam_role.state-manager: Refreshing state... [id=ih-tf-aws-control-289256138624-state-manager]
module.ih-tf-aws-control-289256138624-admin.aws_iam_role.admin: Refreshing state... [id=ih-tf-aws-control-289256138624-admin]
module.ih-tf-aws-control-289256138624-state-manager.aws_iam_role_policy_attachment.state-manager: Refreshing state... [id=ih-tf-aws-control-289256138624-state-manager-20230702010954358800000002]
data.aws_iam_policy.administrator-access: Read complete after 3s [id=arn:aws:iam::aws:policy/AdministratorAccess]
aws_iam_role_policy_attachment.ih-tf-aws-control: Refreshing state... [id=ih-tf-aws-control-20230630003530530900000001]
aws_iam_role_policy_attachment.ih-tf-github-control: Refreshing state... [id=ih-tf-github-control-20230627172734370400000002]
aws_iam_role_policy_attachment.ih-tf-terraform-control: Refreshing state... [id=ih-tf-terraform-control-20230627172733931200000001]
module.ih-tf-aws-control-289256138624-admin.data.aws_iam_policy.administrator-access: Read complete after 3s [id=arn:aws:iam::aws:policy/AdministratorAccess]
module.ih-tf-aws-control-289256138624-admin.aws_iam_role_policy_attachment.admin: Refreshing state... [id=ih-tf-aws-control-289256138624-admin-20230702015240186500000001]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.buckets["infrahouse-aws-control-493370826424"].aws_s3_bucket.state-bucket will be created
  + resource "aws_s3_bucket" "state-bucket" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "infrahouse-aws-control-493370826424"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "description" = "Terraform state for ci-cd account https://github.com/infrahouse/aws-control-493370826424"
        }
      + tags_all                    = {
          + "created_by"  = "infrahouse/aws-control-289256138624"
          + "description" = "Terraform state for ci-cd account https://github.com/infrahouse/aws-control-493370826424"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
    }

  # module.buckets["infrahouse-aws-control-493370826424"].aws_s3_bucket_public_access_block.public_access will be created
  + resource "aws_s3_bucket_public_access_block" "public_access" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

  # module.buckets["infrahouse-aws-control-493370826424"].aws_s3_bucket_server_side_encryption_configuration.default will be created
  + resource "aws_s3_bucket_server_side_encryption_configuration" "default" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + rule {
          + apply_server_side_encryption_by_default {
              + sse_algorithm = "AES256"
            }
        }
    }

  # module.buckets["infrahouse-aws-control-493370826424"].aws_s3_bucket_versioning.enabled will be created
  + resource "aws_s3_bucket_versioning" "enabled" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + versioning_configuration {
          + mfa_delete = (known after apply)
          + status     = "Enabled"
        }
    }

  # module.ih-tf-aws-control-493370826424-state-manager.aws_iam_policy.permissions will be created
  + resource "aws_iam_policy" "permissions" {
      + arn         = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
      + name_prefix = "ih-tf-aws-control-493370826424-state-manager"
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "s3:ListBucket"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:s3:::infrahouse-aws-control-493370826424"
                      + Sid      = ""
                    },
                  + {
                      + Action   = [
                          + "s3:PutObject",
                          + "s3:GetObject",
                          + "s3:DeleteObject",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:s3:::infrahouse-aws-control-493370826424/terraform.tfstate",
                          + "arn:aws:s3:::infrahouse-aws-control-493370826424/plans/*",
                        ]
                      + Sid      = ""
                    },
                  + {
                      + Action   = [
                          + "dynamodb:PutItem",
                          + "dynamodb:GetItem",
                          + "dynamodb:DescribeTable",
                          + "dynamodb:DeleteItem",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:dynamodb:us-west-1:289256138624:table/infrahouse-terraform-state-locks"
                      + Sid      = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = {
          + "created_by" = "infrahouse/aws-control-289256138624"
        }
    }

  # module.ih-tf-aws-control-493370826424-state-manager.aws_iam_role.state-manager will be created
  + resource "aws_iam_role" "state-manager" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = [
                              + "arn:aws:iam::990466748045:user/aleks",
                              + "arn:aws:iam::493370826424:role/ih-tf-aws-control-303467602807-github",
                            ]
                        }
                      + Sid       = "000"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + description           = "Role to manage a terraform state of a repo"
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "ih-tf-aws-control-493370826424-state-manager"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + role_last_used        = (known after apply)
      + tags_all              = {
          + "created_by" = "infrahouse/aws-control-289256138624"
        }
      + unique_id             = (known after apply)
    }

  # module.ih-tf-aws-control-493370826424-state-manager.aws_iam_role_policy_attachment.state-manager will be created
  + resource "aws_iam_role_policy_attachment" "state-manager" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "ih-tf-aws-control-493370826424-state-manager"
    }

Plan: 7 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tf.plan

To perform exactly these actions, run the following command to apply:
    terraform apply "tf.plan"
::debug::Terraform exited with code 0.
::debug::stdout: module.buckets["infrahouse-aws-control-303467602807"].aws_s3_bucket.state-bucket: Refreshing state... [id=infrahouse-aws-control-303467602807]%0Aaws_dynamodb_table.terraform_locks: Refreshing state... [id=infrahouse-terraform-state-locks]%0Amodule.ih-tf-aws-control-990466748045-state-manager.data.aws_iam_policy_document.assume: Reading...%0Amodule.buckets["infrahouse-aws-control-990466748045"].aws_s3_bucket.state-bucket: Refreshing state... [id=infrahouse-aws-control-990466748045]%0Amodule.ih-tf-aws-control-303467602807-state-manager.data.aws_iam_policy_document.assume: Reading...%0Amodule.ih-tf-aws-control-289256138624-admin.data.aws_iam_policy_document.github-permissions: Reading...%0Amodule.github-connector.aws_iam_openid_connect_provider.github: Refreshing state... [id=arn:aws:iam::289256138624:oidc-provider/token.actions.githubusercontent.com]%0Adata.aws_iam_policy.administrator-access: Reading...%0Amodule.ih-tf-aws-control-990466748045-state-manager.data.aws_iam_policy_document.assume: Read complete after 0s [id=2670099516]%0Amodule.ih-tf-aws-control-289256138624-admin.data.aws_iam_policy_document.github-permissions: Read complete after 0s [id=1603774485]%0Amodule.ih-tf-aws-control-303467602807-state-manager.data.aws_iam_policy_document.assume: Read complete after 0s [id=4163919237]%0Amodule.buckets["infrahouse-github-state"].aws_s3_bucket.state-bucket: Refreshing state... [id=infrahouse-github-state]%0Amodule.ih-tf-aws-control-493370826424-state-manager.data.aws_iam_policy_document.assume: Reading...%0Amodule.buckets["infrahouse-aws-control-289256138624"].aws_s3_bucket.state-bucket: Refreshing state... [id=infrahouse-aws-control-289256138624]%0Amodule.ih-tf-aws-control-493370826424-state-manager.data.aws_iam_policy_document.assume: Read complete after 0s [id=3002917113]%0Amodule.ih-tf-aws-control-289256138624-admin.data.aws_iam_policy.administrator-access: Reading...%0Amodule.ih-tf-aws-control-990466748045-state-manager.aws_iam_role.state-manager: Refreshing state... [id=ih-tf-aws-control-state-manager]%0Amodule.ih-tf-aws-control-303467602807-state-manager.aws_iam_role.state-manager: Refreshing state... [id=ih-tf-aws-control-303467602807-state-manager]%0Adata.aws_iam_policy_document.ih-tf-terraform-control-assume: Reading...%0Adata.aws_iam_policy_document.ih-tf-terraform-control-assume: Read complete after 0s [id=1154989936]%0Adata.aws_iam_policy_document.ih-tf-aws-control-assume: Reading...%0Adata.aws_iam_policy_document.ih-tf-aws-control-assume: Read complete after 0s [id=1268673852]%0Adata.aws_iam_policy_document.ih-tf-github-control-assume: Reading...%0Adata.aws_iam_policy_document.ih-tf-github-control-assume: Read complete after 0s [id=1521129737]%0Amodule.ih-tf-aws-control-289256138624-state-manager.data.aws_iam_policy_document.permissions: Reading...%0Amodule.ih-tf-aws-control-289256138624-state-manager.data.aws_iam_policy_document.permissions: Read complete after 0s [id=1875560935]%0Amodule.ih-tf-aws-control-493370826424-state-manager.data.aws_iam_policy_document.permissions: Reading...%0Amodule.ih-tf-aws-control-493370826424-state-manager.data.aws_iam_policy_document.permissions: Read complete after 0s [id=3986654380]%0Amodule.ih-tf-aws-control-990466748045-state-manager.data.aws_iam_policy_document.permissions: Reading...%0Amodule.ih-tf-aws-control-990466748045-state-manager.data.aws_iam_policy_document.permissions: Read complete after 0s [id=2787982525]%0Amodule.ih-tf-aws-control-303467602807-state-manager.data.aws_iam_policy_document.permissions: Reading...%0Amodule.ih-tf-aws-control-303467602807-state-manager.data.aws_iam_policy_document.permissions: Read complete after 0s [id=3056019456]%0Aaws_iam_role.ih-tf-terraform-control: Refreshing state... [id=ih-tf-terraform-control]%0Aaws_iam_role.ih-tf-aws-control: Refreshing state... [id=ih-tf-aws-control]%0Aaws_iam_role.ih-tf-github-control: Refreshing state... [id=ih-tf-github-control]%0Amodule.ih-tf-aws-control-289256138624-state-manager.aws_iam_policy.permissions: Refreshing state... [id=arn:aws:iam::289256138624:policy/ih-tf-aws-control-289256138624-state-manager20230702010953834400000001]%0Amodule.ih-tf-aws-control-990466748045-state-manager.aws_iam_policy.permissions: Refreshing state... [id=arn:aws:iam::289256138624:policy/ih-tf-aws-control-state-manager20230703025728648400000001]%0Amodule.ih-tf-aws-control-303467602807-state-manager.aws_iam_policy.permissions: Refreshing state... [id=arn:aws:iam::289256138624:policy/ih-tf-aws-control-303467602807-state-manager20230702155036825500000001]%0Amodule.buckets["infrahouse-github-state"].aws_s3_bucket_public_access_block.public_access: Refreshing state... [id=infrahouse-github-state]%0Amodule.buckets["infrahouse-aws-control-303467602807"].aws_s3_bucket_public_access_block.public_access: Refreshing state... [id=infrahouse-aws-control-303467602807]%0Amodule.buckets["infrahouse-aws-control-289256138624"].aws_s3_bucket_public_access_block.public_access: Refreshing state... [id=infrahouse-aws-control-289256138624]%0Amodule.buckets["infrahouse-aws-control-990466748045"].aws_s3_bucket_public_access_block.public_access: Refreshing state... [id=infrahouse-aws-control-990466748045]%0Amodule.buckets["infrahouse-github-state"].aws_s3_bucket_server_side_encryption_configuration.default: Refreshing state... [id=infrahouse-github-state]%0Amodule.ih-tf-aws-control-289256138624-admin.data.aws_iam_policy_document.github-assume: Reading...%0Amodule.ih-tf-aws-control-289256138624-admin.data.aws_iam_policy_document.github-assume: Read complete after 0s [id=2022835186]%0Amodule.buckets["infrahouse-github-state"].aws_s3_bucket_versioning.enabled: Refreshing state... [id=infrahouse-github-state]%0Amodule.buckets["infrahouse-aws-control-303467602807"].aws_s3_bucket_server_side_encryption_configuration.default: Refreshing state... [id=infrahouse-aws-control-303467602807]%0Amodule.buckets["infrahouse-aws-control-289256138624"].aws_s3_bucket_server_side_encryption_configuration.default: Refreshing state... [id=infrahouse-aws-control-289256138624]%0Amodule.buckets["infrahouse-aws-control-990466748045"].aws_s3_bucket_server_side_encryption_configuration.default: Refreshing state... [id=infrahouse-aws-control-990466748045]%0Amodule.buckets["infrahouse-aws-control-289256138624"].aws_s3_bucket_versioning.enabled: Refreshing state... [id=infrahouse-aws-control-289256138624]%0Amodule.buckets["infrahouse-aws-control-303467602807"].aws_s3_bucket_versioning.enabled: Refreshing state... [id=infrahouse-aws-control-303467602807]%0Amodule.buckets["infrahouse-aws-control-990466748045"].aws_s3_bucket_versioning.enabled: Refreshing state... [id=infrahouse-aws-control-990466748045]%0Amodule.ih-tf-aws-control-289256138624-admin.aws_iam_role.github: Refreshing state... [id=ih-tf-aws-control-289256138624-github]%0Amodule.ih-tf-aws-control-990466748045-state-manager.aws_iam_role_policy_attachment.state-manager: Refreshing state... [id=ih-tf-aws-control-state-manager-20230703025729520400000002]%0Amodule.ih-tf-aws-control-303467602807-state-manager.aws_iam_role_policy_attachment.state-manager: Refreshing state... [id=ih-tf-aws-control-303467602807-state-manager-20230702155037054300000002]%0Amodule.ih-tf-aws-control-289256138624-state-manager.data.aws_iam_policy_document.assume: Reading...%0Amodule.ih-tf-aws-control-289256138624-admin.data.aws_iam_policy_document.admin-assume: Reading...%0Amodule.ih-tf-aws-control-289256138624-state-manager.data.aws_iam_policy_document.assume: Read complete after 0s [id=2704423537]%0Amodule.ih-tf-aws-control-289256138624-admin.data.aws_iam_policy_document.admin-assume: Read complete after 0s [id=413646908]%0Amodule.ih-tf-aws-control-289256138624-state-manager.aws_iam_role.state-manager: Refreshing state... [id=ih-tf-aws-control-289256138624-state-manager]%0Amodule.ih-tf-aws-control-289256138624-admin.aws_iam_role.admin: Refreshing state... [id=ih-tf-aws-control-289256138624-admin]%0Amodule.ih-tf-aws-control-289256138624-state-manager.aws_iam_role_policy_attachment.state-manager: Refreshing state... [id=ih-tf-aws-control-289256138624-state-manager-20230702010954358800000002]%0Adata.aws_iam_policy.administrator-access: Read complete after 3s [id=arn:aws:iam::aws:policy/AdministratorAccess]%0Aaws_iam_role_policy_attachment.ih-tf-aws-control: Refreshing state... [id=ih-tf-aws-control-20230630003530530900000001]%0Aaws_iam_role_policy_attachment.ih-tf-github-control: Refreshing state... [id=ih-tf-github-control-20230627172734370400000002]%0Aaws_iam_role_policy_attachment.ih-tf-terraform-control: Refreshing state... [id=ih-tf-terraform-control-20230627172733931200000001]%0Amodule.ih-tf-aws-control-289256138624-admin.data.aws_iam_policy.administrator-access: Read complete after 3s [id=arn:aws:iam::aws:policy/AdministratorAccess]%0Amodule.ih-tf-aws-control-289256138624-admin.aws_iam_role_policy_attachment.admin: Refreshing state... [id=ih-tf-aws-control-289256138624-admin-20230702015240186500000001]%0A%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A%0ATerraform will perform the following actions:%0A%0A  # module.buckets["infrahouse-aws-control-493370826424"].aws_s3_bucket.state-bucket will be created%0A  + resource "aws_s3_bucket" "state-bucket" {%0A      + acceleration_status         = (known after apply)%0A      + acl                         = (known after apply)%0A      + arn                         = (known after apply)%0A      + bucket                      = "infrahouse-aws-control-493370826424"%0A      + bucket_domain_name          = (known after apply)%0A      + bucket_prefix               = (known after apply)%0A      + bucket_regional_domain_name = (known after apply)%0A      + force_destroy               = false%0A      + hosted_zone_id              = (known after apply)%0A      + id                          = (known after apply)%0A      + object_lock_enabled         = (known after apply)%0A      + policy                      = (known after apply)%0A      + region                      = (known after apply)%0A      + request_payer               = (known after apply)%0A      + tags                        = {%0A          + "description" = "Terraform state for ci-cd account https://github.com/infrahouse/aws-control-493370826424"%0A        }%0A      + tags_all                    = {%0A          + "created_by"  = "infrahouse/aws-control-289256138624"%0A          + "description" = "Terraform state for ci-cd account https://github.com/infrahouse/aws-control-493370826424"%0A        }%0A      + website_domain              = (known after apply)%0A      + website_endpoint            = (known after apply)%0A    }%0A%0A  # module.buckets["infrahouse-aws-control-493370826424"].aws_s3_bucket_public_access_block.public_access will be created%0A  + resource "aws_s3_bucket_public_access_block" "public_access" {%0A      + block_public_acls       = true%0A      + block_public_policy     = true%0A      + bucket                  = (known after apply)%0A      + id                      = (known after apply)%0A      + ignore_public_acls      = true%0A      + restrict_public_buckets = true%0A    }%0A%0A  # module.buckets["infrahouse-aws-control-493370826424"].aws_s3_bucket_server_side_encryption_configuration.default will be created%0A  + resource "aws_s3_bucket_server_side_encryption_configuration" "default" {%0A      + bucket = (known after apply)%0A      + id     = (known after apply)%0A%0A      + rule {%0A          + apply_server_side_encryption_by_default {%0A              + sse_algorithm = "AES256"%0A            }%0A        }%0A    }%0A%0A  # module.buckets["infrahouse-aws-control-493370826424"].aws_s3_bucket_versioning.enabled will be created%0A  + resource "aws_s3_bucket_versioning" "enabled" {%0A      + bucket = (known after apply)%0A      + id     = (known after apply)%0A%0A      + versioning_configuration {%0A          + mfa_delete = (known after apply)%0A          + status     = "Enabled"%0A        }%0A    }%0A%0A  # module.ih-tf-aws-control-493370826424-state-manager.aws_iam_policy.permissions will be created%0A  + resource "aws_iam_policy" "permissions" {%0A      + arn         = (known after apply)%0A      + id          = (known after apply)%0A      + name        = (known after apply)%0A      + name_prefix = "ih-tf-aws-control-493370826424-state-manager"%0A      + path        = "/"%0A      + policy      = jsonencode(%0A            {%0A              + Statement = [%0A                  + {%0A                      + Action   = "s3:ListBucket"%0A                      + Effect   = "Allow"%0A                      + Resource = "arn:aws:s3:::infrahouse-aws-control-493370826424"%0A                      + Sid      = ""%0A                    },%0A                  + {%0A                      + Action   = [%0A                          + "s3:PutObject",%0A                          + "s3:GetObject",%0A                          + "s3:DeleteObject",%0A                        ]%0A                      + Effect   = "Allow"%0A                      + Resource = [%0A                          + "arn:aws:s3:::infrahouse-aws-control-493370826424/terraform.tfstate",%0A                          + "arn:aws:s3:::infrahouse-aws-control-493370826424/plans/*",%0A                        ]%0A                      + Sid      = ""%0A                    },%0A                  + {%0A                      + Action   = [%0A                          + "dynamodb:PutItem",%0A                          + "dynamodb:GetItem",%0A                          + "dynamodb:DescribeTable",%0A                          + "dynamodb:DeleteItem",%0A                        ]%0A                      + Effect   = "Allow"%0A                      + Resource = "arn:aws:dynamodb:us-west-1:289256138624:table/infrahouse-terraform-state-locks"%0A                      + Sid      = ""%0A                    },%0A                ]%0A              + Version   = "2012-10-17"%0A            }%0A        )%0A      + policy_id   = (known after apply)%0A      + tags_all    = {%0A          + "created_by" = "infrahouse/aws-control-289256138624"%0A        }%0A    }%0A%0A  # module.ih-tf-aws-control-493370826424-state-manager.aws_iam_role.state-manager will be created%0A  + resource "aws_iam_role" "state-manager" {%0A      + arn                   = (known after apply)%0A      + assume_role_policy    = jsonencode(%0A            {%0A              + Statement = [%0A                  + {%0A                      + Action    = "sts:AssumeRole"%0A                      + Effect    = "Allow"%0A                      + Principal = {%0A                          + AWS = [%0A                              + "arn:aws:iam::990466748045:user/aleks",%0A                              + "arn:aws:iam::493370826424:role/ih-tf-aws-control-303467602807-github",%0A                            ]%0A                        }%0A                      + Sid       = "000"%0A                    },%0A                ]%0A              + Version   = "2012-10-17"%0A            }%0A        )%0A      + create_date           = (known after apply)%0A      + description           = "Role to manage a terraform state of a repo"%0A      + force_detach_policies = false%0A      + id                    = (known after apply)%0A      + managed_policy_arns   = (known after apply)%0A      + max_session_duration  = 3600%0A      + name                  = "ih-tf-aws-control-493370826424-state-manager"%0A      + name_prefix           = (known after apply)%0A      + path                  = "/"%0A      + role_last_used        = (known after apply)%0A      + tags_all              = {%0A          + "created_by" = "infrahouse/aws-control-289256138624"%0A        }%0A      + unique_id             = (known after apply)%0A    }%0A%0A  # module.ih-tf-aws-control-493370826424-state-manager.aws_iam_role_policy_attachment.state-manager will be created%0A  + resource "aws_iam_role_policy_attachment" "state-manager" {%0A      + id         = (known after apply)%0A      + policy_arn = (known after apply)%0A      + role       = "ih-tf-aws-control-493370826424-state-manager"%0A    }%0A%0APlan: 7 to add, 0 to change, 0 to destroy.%0A%0A─────────────────────────────────────────────────────────────────────────────%0A%0ASaved the plan to: tf.plan%0A%0ATo perform exactly these actions, run the following command to apply:%0A    terraform apply "tf.plan"%0A
::debug::stderr: 
::debug::exitcode: 0
```
</details>
<details>
<summary>STDERR</summary>

```no output```
</details>
<details><summary><i>metadata</i></summary>
<p>
```eyJzMzovL2luZnJhaG91c2UtYXdzLWNvbnRyb2wtMjg5MjU2MTM4NjI0L3RlcnJhZm9ybS50ZnN0YXRlIjogeyJzdWNjZXNzIjogdHJ1ZSwgInN0ZG91dCI6ICJbY29tbWFuZF0vaG9tZS9ydW5uZXIvd29yay9fdGVtcC8yM2UwNzI3ZC0zNjBmLTQ0NTktOGZhMC1jNGU1Mzc2ZmUzMjcvdGVycmFmb3JtLWJpbiBwbGFuIC1uby1jb2xvciAtLW91dD10Zi5wbGFuXG5tb2R1bGUuYnVja2V0c1tcImluZnJhaG91c2UtYXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3XCJdLmF3c19zM19idWNrZXQuc3RhdGUtYnVja2V0OiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pbmZyYWhvdXNlLWF3cy1jb250cm9sLTMwMzQ2NzYwMjgwN11cbmF3c19keW5hbW9kYl90YWJsZS50ZXJyYWZvcm1fbG9ja3M6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWluZnJhaG91c2UtdGVycmFmb3JtLXN0YXRlLWxvY2tzXVxubW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTk5MDQ2Njc0ODA0NS1zdGF0ZS1tYW5hZ2VyLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuYXNzdW1lOiBSZWFkaW5nLi4uXG5tb2R1bGUuYnVja2V0c1tcImluZnJhaG91c2UtYXdzLWNvbnRyb2wtOTkwNDY2NzQ4MDQ1XCJdLmF3c19zM19idWNrZXQuc3RhdGUtYnVja2V0OiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pbmZyYWhvdXNlLWF3cy1jb250cm9sLTk5MDQ2Njc0ODA0NV1cbm1vZHVsZS5paC10Zi1hd3MtY29udHJvbC0zMDM0Njc2MDI4MDctc3RhdGUtbWFuYWdlci5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmFzc3VtZTogUmVhZGluZy4uLlxubW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTI4OTI1NjEzODYyNC1hZG1pbi5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmdpdGh1Yi1wZXJtaXNzaW9uczogUmVhZGluZy4uLlxubW9kdWxlLmdpdGh1Yi1jb25uZWN0b3IuYXdzX2lhbV9vcGVuaWRfY29ubmVjdF9wcm92aWRlci5naXRodWI6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWFybjphd3M6aWFtOjoyODkyNTYxMzg2MjQ6b2lkYy1wcm92aWRlci90b2tlbi5hY3Rpb25zLmdpdGh1YnVzZXJjb250ZW50LmNvbV1cbmRhdGEuYXdzX2lhbV9wb2xpY3kuYWRtaW5pc3RyYXRvci1hY2Nlc3M6IFJlYWRpbmcuLi5cbm1vZHVsZS5paC10Zi1hd3MtY29udHJvbC05OTA0NjY3NDgwNDUtc3RhdGUtbWFuYWdlci5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmFzc3VtZTogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9MjY3MDA5OTUxNl1cbm1vZHVsZS5paC10Zi1hd3MtY29udHJvbC0yODkyNTYxMzg2MjQtYWRtaW4uZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5naXRodWItcGVybWlzc2lvbnM6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTE2MDM3NzQ0ODVdXG5tb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3LXN0YXRlLW1hbmFnZXIuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5hc3N1bWU6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTQxNjM5MTkyMzddXG5tb2R1bGUuYnVja2V0c1tcImluZnJhaG91c2UtZ2l0aHViLXN0YXRlXCJdLmF3c19zM19idWNrZXQuc3RhdGUtYnVja2V0OiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pbmZyYWhvdXNlLWdpdGh1Yi1zdGF0ZV1cbm1vZHVsZS5paC10Zi1hd3MtY29udHJvbC00OTMzNzA4MjY0MjQtc3RhdGUtbWFuYWdlci5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmFzc3VtZTogUmVhZGluZy4uLlxubW9kdWxlLmJ1Y2tldHNbXCJpbmZyYWhvdXNlLWF3cy1jb250cm9sLTI4OTI1NjEzODYyNFwiXS5hd3NfczNfYnVja2V0LnN0YXRlLWJ1Y2tldDogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aW5mcmFob3VzZS1hd3MtY29udHJvbC0yODkyNTYxMzg2MjRdXG5tb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0LXN0YXRlLW1hbmFnZXIuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5hc3N1bWU6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTMwMDI5MTcxMTNdXG5tb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtMjg5MjU2MTM4NjI0LWFkbWluLmRhdGEuYXdzX2lhbV9wb2xpY3kuYWRtaW5pc3RyYXRvci1hY2Nlc3M6IFJlYWRpbmcuLi5cbm1vZHVsZS5paC10Zi1hd3MtY29udHJvbC05OTA0NjY3NDgwNDUtc3RhdGUtbWFuYWdlci5hd3NfaWFtX3JvbGUuc3RhdGUtbWFuYWdlcjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aWgtdGYtYXdzLWNvbnRyb2wtc3RhdGUtbWFuYWdlcl1cbm1vZHVsZS5paC10Zi1hd3MtY29udHJvbC0zMDM0Njc2MDI4MDctc3RhdGUtbWFuYWdlci5hd3NfaWFtX3JvbGUuc3RhdGUtbWFuYWdlcjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aWgtdGYtYXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3LXN0YXRlLW1hbmFnZXJdXG5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmloLXRmLXRlcnJhZm9ybS1jb250cm9sLWFzc3VtZTogUmVhZGluZy4uLlxuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5paC10Zi10ZXJyYWZvcm0tY29udHJvbC1hc3N1bWU6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTExNTQ5ODk5MzZdXG5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmloLXRmLWF3cy1jb250cm9sLWFzc3VtZTogUmVhZGluZy4uLlxuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5paC10Zi1hd3MtY29udHJvbC1hc3N1bWU6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTEyNjg2NzM4NTJdXG5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmloLXRmLWdpdGh1Yi1jb250cm9sLWFzc3VtZTogUmVhZGluZy4uLlxuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5paC10Zi1naXRodWItY29udHJvbC1hc3N1bWU6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTE1MjExMjk3MzddXG5tb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtMjg5MjU2MTM4NjI0LXN0YXRlLW1hbmFnZXIuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5wZXJtaXNzaW9uczogUmVhZGluZy4uLlxubW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTI4OTI1NjEzODYyNC1zdGF0ZS1tYW5hZ2VyLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQucGVybWlzc2lvbnM6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTE4NzU1NjA5MzVdXG5tb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0LXN0YXRlLW1hbmFnZXIuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5wZXJtaXNzaW9uczogUmVhZGluZy4uLlxubW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTQ5MzM3MDgyNjQyNC1zdGF0ZS1tYW5hZ2VyLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQucGVybWlzc2lvbnM6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTM5ODY2NTQzODBdXG5tb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtOTkwNDY2NzQ4MDQ1LXN0YXRlLW1hbmFnZXIuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5wZXJtaXNzaW9uczogUmVhZGluZy4uLlxubW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTk5MDQ2Njc0ODA0NS1zdGF0ZS1tYW5hZ2VyLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQucGVybWlzc2lvbnM6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTI3ODc5ODI1MjVdXG5tb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3LXN0YXRlLW1hbmFnZXIuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5wZXJtaXNzaW9uczogUmVhZGluZy4uLlxubW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTMwMzQ2NzYwMjgwNy1zdGF0ZS1tYW5hZ2VyLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQucGVybWlzc2lvbnM6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTMwNTYwMTk0NTZdXG5hd3NfaWFtX3JvbGUuaWgtdGYtdGVycmFmb3JtLWNvbnRyb2w6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWloLXRmLXRlcnJhZm9ybS1jb250cm9sXVxuYXdzX2lhbV9yb2xlLmloLXRmLWF3cy1jb250cm9sOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1paC10Zi1hd3MtY29udHJvbF1cbmF3c19pYW1fcm9sZS5paC10Zi1naXRodWItY29udHJvbDogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aWgtdGYtZ2l0aHViLWNvbnRyb2xdXG5tb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtMjg5MjU2MTM4NjI0LXN0YXRlLW1hbmFnZXIuYXdzX2lhbV9wb2xpY3kucGVybWlzc2lvbnM6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWFybjphd3M6aWFtOjoyODkyNTYxMzg2MjQ6cG9saWN5L2loLXRmLWF3cy1jb250cm9sLTI4OTI1NjEzODYyNC1zdGF0ZS1tYW5hZ2VyMjAyMzA3MDIwMTA5NTM4MzQ0MDAwMDAwMDFdXG5tb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtOTkwNDY2NzQ4MDQ1LXN0YXRlLW1hbmFnZXIuYXdzX2lhbV9wb2xpY3kucGVybWlzc2lvbnM6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWFybjphd3M6aWFtOjoyODkyNTYxMzg2MjQ6cG9saWN5L2loLXRmLWF3cy1jb250cm9sLXN0YXRlLW1hbmFnZXIyMDIzMDcwMzAyNTcyODY0ODQwMDAwMDAwMV1cbm1vZHVsZS5paC10Zi1hd3MtY29udHJvbC0zMDM0Njc2MDI4MDctc3RhdGUtbWFuYWdlci5hd3NfaWFtX3BvbGljeS5wZXJtaXNzaW9uczogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXJuOmF3czppYW06OjI4OTI1NjEzODYyNDpwb2xpY3kvaWgtdGYtYXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3LXN0YXRlLW1hbmFnZXIyMDIzMDcwMjE1NTAzNjgyNTUwMDAwMDAwMV1cbm1vZHVsZS5idWNrZXRzW1wiaW5mcmFob3VzZS1naXRodWItc3RhdGVcIl0uYXdzX3MzX2J1Y2tldF9wdWJsaWNfYWNjZXNzX2Jsb2NrLnB1YmxpY19hY2Nlc3M6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWluZnJhaG91c2UtZ2l0aHViLXN0YXRlXVxubW9kdWxlLmJ1Y2tldHNbXCJpbmZyYWhvdXNlLWF3cy1jb250cm9sLTMwMzQ2NzYwMjgwN1wiXS5hd3NfczNfYnVja2V0X3B1YmxpY19hY2Nlc3NfYmxvY2sucHVibGljX2FjY2VzczogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aW5mcmFob3VzZS1hd3MtY29udHJvbC0zMDM0Njc2MDI4MDddXG5tb2R1bGUuYnVja2V0c1tcImluZnJhaG91c2UtYXdzLWNvbnRyb2wtMjg5MjU2MTM4NjI0XCJdLmF3c19zM19idWNrZXRfcHVibGljX2FjY2Vzc19ibG9jay5wdWJsaWNfYWNjZXNzOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pbmZyYWhvdXNlLWF3cy1jb250cm9sLTI4OTI1NjEzODYyNF1cbm1vZHVsZS5idWNrZXRzW1wiaW5mcmFob3VzZS1hd3MtY29udHJvbC05OTA0NjY3NDgwNDVcIl0uYXdzX3MzX2J1Y2tldF9wdWJsaWNfYWNjZXNzX2Jsb2NrLnB1YmxpY19hY2Nlc3M6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWluZnJhaG91c2UtYXdzLWNvbnRyb2wtOTkwNDY2NzQ4MDQ1XVxubW9kdWxlLmJ1Y2tldHNbXCJpbmZyYWhvdXNlLWdpdGh1Yi1zdGF0ZVwiXS5hd3NfczNfYnVja2V0X3NlcnZlcl9zaWRlX2VuY3J5cHRpb25fY29uZmlndXJhdGlvbi5kZWZhdWx0OiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pbmZyYWhvdXNlLWdpdGh1Yi1zdGF0ZV1cbm1vZHVsZS5paC10Zi1hd3MtY29udHJvbC0yODkyNTYxMzg2MjQtYWRtaW4uZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5naXRodWItYXNzdW1lOiBSZWFkaW5nLi4uXG5tb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtMjg5MjU2MTM4NjI0LWFkbWluLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuZ2l0aHViLWFzc3VtZTogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9MjAyMjgzNTE4Nl1cbm1vZHVsZS5idWNrZXRzW1wiaW5mcmFob3VzZS1naXRodWItc3RhdGVcIl0uYXdzX3MzX2J1Y2tldF92ZXJzaW9uaW5nLmVuYWJsZWQ6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWluZnJhaG91c2UtZ2l0aHViLXN0YXRlXVxubW9kdWxlLmJ1Y2tldHNbXCJpbmZyYWhvdXNlLWF3cy1jb250cm9sLTMwMzQ2NzYwMjgwN1wiXS5hd3NfczNfYnVja2V0X3NlcnZlcl9zaWRlX2VuY3J5cHRpb25fY29uZmlndXJhdGlvbi5kZWZhdWx0OiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pbmZyYWhvdXNlLWF3cy1jb250cm9sLTMwMzQ2NzYwMjgwN11cbm1vZHVsZS5idWNrZXRzW1wiaW5mcmFob3VzZS1hd3MtY29udHJvbC0yODkyNTYxMzg2MjRcIl0uYXdzX3MzX2J1Y2tldF9zZXJ2ZXJfc2lkZV9lbmNyeXB0aW9uX2NvbmZpZ3VyYXRpb24uZGVmYXVsdDogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aW5mcmFob3VzZS1hd3MtY29udHJvbC0yODkyNTYxMzg2MjRdXG5tb2R1bGUuYnVja2V0c1tcImluZnJhaG91c2UtYXdzLWNvbnRyb2wtOTkwNDY2NzQ4MDQ1XCJdLmF3c19zM19idWNrZXRfc2VydmVyX3NpZGVfZW5jcnlwdGlvbl9jb25maWd1cmF0aW9uLmRlZmF1bHQ6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWluZnJhaG91c2UtYXdzLWNvbnRyb2wtOTkwNDY2NzQ4MDQ1XVxubW9kdWxlLmJ1Y2tldHNbXCJpbmZyYWhvdXNlLWF3cy1jb250cm9sLTI4OTI1NjEzODYyNFwiXS5hd3NfczNfYnVja2V0X3ZlcnNpb25pbmcuZW5hYmxlZDogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aW5mcmFob3VzZS1hd3MtY29udHJvbC0yODkyNTYxMzg2MjRdXG5tb2R1bGUuYnVja2V0c1tcImluZnJhaG91c2UtYXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3XCJdLmF3c19zM19idWNrZXRfdmVyc2lvbmluZy5lbmFibGVkOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pbmZyYWhvdXNlLWF3cy1jb250cm9sLTMwMzQ2NzYwMjgwN11cbm1vZHVsZS5idWNrZXRzW1wiaW5mcmFob3VzZS1hd3MtY29udHJvbC05OTA0NjY3NDgwNDVcIl0uYXdzX3MzX2J1Y2tldF92ZXJzaW9uaW5nLmVuYWJsZWQ6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWluZnJhaG91c2UtYXdzLWNvbnRyb2wtOTkwNDY2NzQ4MDQ1XVxubW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTI4OTI1NjEzODYyNC1hZG1pbi5hd3NfaWFtX3JvbGUuZ2l0aHViOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1paC10Zi1hd3MtY29udHJvbC0yODkyNTYxMzg2MjQtZ2l0aHViXVxubW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTk5MDQ2Njc0ODA0NS1zdGF0ZS1tYW5hZ2VyLmF3c19pYW1fcm9sZV9wb2xpY3lfYXR0YWNobWVudC5zdGF0ZS1tYW5hZ2VyOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1paC10Zi1hd3MtY29udHJvbC1zdGF0ZS1tYW5hZ2VyLTIwMjMwNzAzMDI1NzI5NTIwNDAwMDAwMDAyXVxubW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTMwMzQ2NzYwMjgwNy1zdGF0ZS1tYW5hZ2VyLmF3c19pYW1fcm9sZV9wb2xpY3lfYXR0YWNobWVudC5zdGF0ZS1tYW5hZ2VyOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1paC10Zi1hd3MtY29udHJvbC0zMDM0Njc2MDI4MDctc3RhdGUtbWFuYWdlci0yMDIzMDcwMjE1NTAzNzA1NDMwMDAwMDAwMl1cbm1vZHVsZS5paC10Zi1hd3MtY29udHJvbC0yODkyNTYxMzg2MjQtc3RhdGUtbWFuYWdlci5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmFzc3VtZTogUmVhZGluZy4uLlxubW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTI4OTI1NjEzODYyNC1hZG1pbi5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmFkbWluLWFzc3VtZTogUmVhZGluZy4uLlxubW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTI4OTI1NjEzODYyNC1zdGF0ZS1tYW5hZ2VyLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuYXNzdW1lOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD0yNzA0NDIzNTM3XVxubW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTI4OTI1NjEzODYyNC1hZG1pbi5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmFkbWluLWFzc3VtZTogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9NDEzNjQ2OTA4XVxubW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTI4OTI1NjEzODYyNC1zdGF0ZS1tYW5hZ2VyLmF3c19pYW1fcm9sZS5zdGF0ZS1tYW5hZ2VyOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1paC10Zi1hd3MtY29udHJvbC0yODkyNTYxMzg2MjQtc3RhdGUtbWFuYWdlcl1cbm1vZHVsZS5paC10Zi1hd3MtY29udHJvbC0yODkyNTYxMzg2MjQtYWRtaW4uYXdzX2lhbV9yb2xlLmFkbWluOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1paC10Zi1hd3MtY29udHJvbC0yODkyNTYxMzg2MjQtYWRtaW5dXG5tb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtMjg5MjU2MTM4NjI0LXN0YXRlLW1hbmFnZXIuYXdzX2lhbV9yb2xlX3BvbGljeV9hdHRhY2htZW50LnN0YXRlLW1hbmFnZXI6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWloLXRmLWF3cy1jb250cm9sLTI4OTI1NjEzODYyNC1zdGF0ZS1tYW5hZ2VyLTIwMjMwNzAyMDEwOTU0MzU4ODAwMDAwMDAyXVxuZGF0YS5hd3NfaWFtX3BvbGljeS5hZG1pbmlzdHJhdG9yLWFjY2VzczogUmVhZCBjb21wbGV0ZSBhZnRlciAzcyBbaWQ9YXJuOmF3czppYW06OmF3czpwb2xpY3kvQWRtaW5pc3RyYXRvckFjY2Vzc11cbmF3c19pYW1fcm9sZV9wb2xpY3lfYXR0YWNobWVudC5paC10Zi1hd3MtY29udHJvbDogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aWgtdGYtYXdzLWNvbnRyb2wtMjAyMzA2MzAwMDM1MzA1MzA5MDAwMDAwMDFdXG5hd3NfaWFtX3JvbGVfcG9saWN5X2F0dGFjaG1lbnQuaWgtdGYtZ2l0aHViLWNvbnRyb2w6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWloLXRmLWdpdGh1Yi1jb250cm9sLTIwMjMwNjI3MTcyNzM0MzcwNDAwMDAwMDAyXVxuYXdzX2lhbV9yb2xlX3BvbGljeV9hdHRhY2htZW50LmloLXRmLXRlcnJhZm9ybS1jb250cm9sOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1paC10Zi10ZXJyYWZvcm0tY29udHJvbC0yMDIzMDYyNzE3MjczMzkzMTIwMDAwMDAwMV1cbm1vZHVsZS5paC10Zi1hd3MtY29udHJvbC0yODkyNTYxMzg2MjQtYWRtaW4uZGF0YS5hd3NfaWFtX3BvbGljeS5hZG1pbmlzdHJhdG9yLWFjY2VzczogUmVhZCBjb21wbGV0ZSBhZnRlciAzcyBbaWQ9YXJuOmF3czppYW06OmF3czpwb2xpY3kvQWRtaW5pc3RyYXRvckFjY2Vzc11cbm1vZHVsZS5paC10Zi1hd3MtY29udHJvbC0yODkyNTYxMzg2MjQtYWRtaW4uYXdzX2lhbV9yb2xlX3BvbGljeV9hdHRhY2htZW50LmFkbWluOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1paC10Zi1hd3MtY29udHJvbC0yODkyNTYxMzg2MjQtYWRtaW4tMjAyMzA3MDIwMTUyNDAxODY1MDAwMDAwMDFdXG5cblRlcnJhZm9ybSB1c2VkIHRoZSBzZWxlY3RlZCBwcm92aWRlcnMgdG8gZ2VuZXJhdGUgdGhlIGZvbGxvd2luZyBleGVjdXRpb25cbnBsYW4uIFJlc291cmNlIGFjdGlvbnMgYXJlIGluZGljYXRlZCB3aXRoIHRoZSBmb2xsb3dpbmcgc3ltYm9sczpcbiAgKyBjcmVhdGVcblxuVGVycmFmb3JtIHdpbGwgcGVyZm9ybSB0aGUgZm9sbG93aW5nIGFjdGlvbnM6XG5cbiAgIyBtb2R1bGUuYnVja2V0c1tcImluZnJhaG91c2UtYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0XCJdLmF3c19zM19idWNrZXQuc3RhdGUtYnVja2V0IHdpbGwgYmUgY3JlYXRlZFxuICArIHJlc291cmNlIFwiYXdzX3MzX2J1Y2tldFwiIFwic3RhdGUtYnVja2V0XCIge1xuICAgICAgKyBhY2NlbGVyYXRpb25fc3RhdHVzICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIGFjbCAgICAgICAgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgYXJuICAgICAgICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBidWNrZXQgICAgICAgICAgICAgICAgICAgICAgPSBcImluZnJhaG91c2UtYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0XCJcbiAgICAgICsgYnVja2V0X2RvbWFpbl9uYW1lICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBidWNrZXRfcHJlZml4ICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIGJ1Y2tldF9yZWdpb25hbF9kb21haW5fbmFtZSA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgZm9yY2VfZGVzdHJveSAgICAgICAgICAgICAgID0gZmFsc2VcbiAgICAgICsgaG9zdGVkX3pvbmVfaWQgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBpZCAgICAgICAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIG9iamVjdF9sb2NrX2VuYWJsZWQgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgcG9saWN5ICAgICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyByZWdpb24gICAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIHJlcXVlc3RfcGF5ZXIgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgdGFncyAgICAgICAgICAgICAgICAgICAgICAgID0ge1xuICAgICAgICAgICsgXCJkZXNjcmlwdGlvblwiID0gXCJUZXJyYWZvcm0gc3RhdGUgZm9yIGNpLWNkIGFjY291bnQgaHR0cHM6Ly9naXRodWIuY29tL2luZnJhaG91c2UvYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0XCJcbiAgICAgICAgfVxuICAgICAgKyB0YWdzX2FsbCAgICAgICAgICAgICAgICAgICAgPSB7XG4gICAgICAgICAgKyBcImNyZWF0ZWRfYnlcIiAgPSBcImluZnJhaG91c2UvYXdzLWNvbnRyb2wtMjg5MjU2MTM4NjI0XCJcbiAgICAgICAgICArIFwiZGVzY3JpcHRpb25cIiA9IFwiVGVycmFmb3JtIHN0YXRlIGZvciBjaS1jZCBhY2NvdW50IGh0dHBzOi8vZ2l0aHViLmNvbS9pbmZyYWhvdXNlL2F3cy1jb250cm9sLTQ5MzM3MDgyNjQyNFwiXG4gICAgICAgIH1cbiAgICAgICsgd2Vic2l0ZV9kb21haW4gICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyB3ZWJzaXRlX2VuZHBvaW50ICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgfVxuXG4gICMgbW9kdWxlLmJ1Y2tldHNbXCJpbmZyYWhvdXNlLWF3cy1jb250cm9sLTQ5MzM3MDgyNjQyNFwiXS5hd3NfczNfYnVja2V0X3B1YmxpY19hY2Nlc3NfYmxvY2sucHVibGljX2FjY2VzcyB3aWxsIGJlIGNyZWF0ZWRcbiAgKyByZXNvdXJjZSBcImF3c19zM19idWNrZXRfcHVibGljX2FjY2Vzc19ibG9ja1wiIFwicHVibGljX2FjY2Vzc1wiIHtcbiAgICAgICsgYmxvY2tfcHVibGljX2FjbHMgICAgICAgPSB0cnVlXG4gICAgICArIGJsb2NrX3B1YmxpY19wb2xpY3kgICAgID0gdHJ1ZVxuICAgICAgKyBidWNrZXQgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgaWQgICAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIGlnbm9yZV9wdWJsaWNfYWNscyAgICAgID0gdHJ1ZVxuICAgICAgKyByZXN0cmljdF9wdWJsaWNfYnVja2V0cyA9IHRydWVcbiAgICB9XG5cbiAgIyBtb2R1bGUuYnVja2V0c1tcImluZnJhaG91c2UtYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0XCJdLmF3c19zM19idWNrZXRfc2VydmVyX3NpZGVfZW5jcnlwdGlvbl9jb25maWd1cmF0aW9uLmRlZmF1bHQgd2lsbCBiZSBjcmVhdGVkXG4gICsgcmVzb3VyY2UgXCJhd3NfczNfYnVja2V0X3NlcnZlcl9zaWRlX2VuY3J5cHRpb25fY29uZmlndXJhdGlvblwiIFwiZGVmYXVsdFwiIHtcbiAgICAgICsgYnVja2V0ID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBpZCAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG5cbiAgICAgICsgcnVsZSB7XG4gICAgICAgICAgKyBhcHBseV9zZXJ2ZXJfc2lkZV9lbmNyeXB0aW9uX2J5X2RlZmF1bHQge1xuICAgICAgICAgICAgICArIHNzZV9hbGdvcml0aG0gPSBcIkFFUzI1NlwiXG4gICAgICAgICAgICB9XG4gICAgICAgIH1cbiAgICB9XG5cbiAgIyBtb2R1bGUuYnVja2V0c1tcImluZnJhaG91c2UtYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0XCJdLmF3c19zM19idWNrZXRfdmVyc2lvbmluZy5lbmFibGVkIHdpbGwgYmUgY3JlYXRlZFxuICArIHJlc291cmNlIFwiYXdzX3MzX2J1Y2tldF92ZXJzaW9uaW5nXCIgXCJlbmFibGVkXCIge1xuICAgICAgKyBidWNrZXQgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIGlkICAgICA9IChrbm93biBhZnRlciBhcHBseSlcblxuICAgICAgKyB2ZXJzaW9uaW5nX2NvbmZpZ3VyYXRpb24ge1xuICAgICAgICAgICsgbWZhX2RlbGV0ZSA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICAgICArIHN0YXR1cyAgICAgPSBcIkVuYWJsZWRcIlxuICAgICAgICB9XG4gICAgfVxuXG4gICMgbW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTQ5MzM3MDgyNjQyNC1zdGF0ZS1tYW5hZ2VyLmF3c19pYW1fcG9saWN5LnBlcm1pc3Npb25zIHdpbGwgYmUgY3JlYXRlZFxuICArIHJlc291cmNlIFwiYXdzX2lhbV9wb2xpY3lcIiBcInBlcm1pc3Npb25zXCIge1xuICAgICAgKyBhcm4gICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgaWQgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIG5hbWUgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBuYW1lX3ByZWZpeCA9IFwiaWgtdGYtYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0LXN0YXRlLW1hbmFnZXJcIlxuICAgICAgKyBwYXRoICAgICAgICA9IFwiL1wiXG4gICAgICArIHBvbGljeSAgICAgID0ganNvbmVuY29kZShcbiAgICAgICAgICAgIHtcbiAgICAgICAgICAgICAgKyBTdGF0ZW1lbnQgPSBbXG4gICAgICAgICAgICAgICAgICArIHtcbiAgICAgICAgICAgICAgICAgICAgICArIEFjdGlvbiAgID0gXCJzMzpMaXN0QnVja2V0XCJcbiAgICAgICAgICAgICAgICAgICAgICArIEVmZmVjdCAgID0gXCJBbGxvd1wiXG4gICAgICAgICAgICAgICAgICAgICAgKyBSZXNvdXJjZSA9IFwiYXJuOmF3czpzMzo6OmluZnJhaG91c2UtYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0XCJcbiAgICAgICAgICAgICAgICAgICAgICArIFNpZCAgICAgID0gXCJcIlxuICAgICAgICAgICAgICAgICAgICB9LFxuICAgICAgICAgICAgICAgICAgKyB7XG4gICAgICAgICAgICAgICAgICAgICAgKyBBY3Rpb24gICA9IFtcbiAgICAgICAgICAgICAgICAgICAgICAgICAgKyBcInMzOlB1dE9iamVjdFwiLFxuICAgICAgICAgICAgICAgICAgICAgICAgICArIFwiczM6R2V0T2JqZWN0XCIsXG4gICAgICAgICAgICAgICAgICAgICAgICAgICsgXCJzMzpEZWxldGVPYmplY3RcIixcbiAgICAgICAgICAgICAgICAgICAgICAgIF1cbiAgICAgICAgICAgICAgICAgICAgICArIEVmZmVjdCAgID0gXCJBbGxvd1wiXG4gICAgICAgICAgICAgICAgICAgICAgKyBSZXNvdXJjZSA9IFtcbiAgICAgICAgICAgICAgICAgICAgICAgICAgKyBcImFybjphd3M6czM6OjppbmZyYWhvdXNlLWF3cy1jb250cm9sLTQ5MzM3MDgyNjQyNC90ZXJyYWZvcm0udGZzdGF0ZVwiLFxuICAgICAgICAgICAgICAgICAgICAgICAgICArIFwiYXJuOmF3czpzMzo6OmluZnJhaG91c2UtYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0L3BsYW5zLypcIixcbiAgICAgICAgICAgICAgICAgICAgICAgIF1cbiAgICAgICAgICAgICAgICAgICAgICArIFNpZCAgICAgID0gXCJcIlxuICAgICAgICAgICAgICAgICAgICB9LFxuICAgICAgICAgICAgICAgICAgKyB7XG4gICAgICAgICAgICAgICAgICAgICAgKyBBY3Rpb24gICA9IFtcbiAgICAgICAgICAgICAgICAgICAgICAgICAgKyBcImR5bmFtb2RiOlB1dEl0ZW1cIixcbiAgICAgICAgICAgICAgICAgICAgICAgICAgKyBcImR5bmFtb2RiOkdldEl0ZW1cIixcbiAgICAgICAgICAgICAgICAgICAgICAgICAgKyBcImR5bmFtb2RiOkRlc2NyaWJlVGFibGVcIixcbiAgICAgICAgICAgICAgICAgICAgICAgICAgKyBcImR5bmFtb2RiOkRlbGV0ZUl0ZW1cIixcbiAgICAgICAgICAgICAgICAgICAgICAgIF1cbiAgICAgICAgICAgICAgICAgICAgICArIEVmZmVjdCAgID0gXCJBbGxvd1wiXG4gICAgICAgICAgICAgICAgICAgICAgKyBSZXNvdXJjZSA9IFwiYXJuOmF3czpkeW5hbW9kYjp1cy13ZXN0LTE6Mjg5MjU2MTM4NjI0OnRhYmxlL2luZnJhaG91c2UtdGVycmFmb3JtLXN0YXRlLWxvY2tzXCJcbiAgICAgICAgICAgICAgICAgICAgICArIFNpZCAgICAgID0gXCJcIlxuICAgICAgICAgICAgICAgICAgICB9LFxuICAgICAgICAgICAgICAgIF1cbiAgICAgICAgICAgICAgKyBWZXJzaW9uICAgPSBcIjIwMTItMTAtMTdcIlxuICAgICAgICAgICAgfVxuICAgICAgICApXG4gICAgICArIHBvbGljeV9pZCAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyB0YWdzX2FsbCAgICA9IHtcbiAgICAgICAgICArIFwiY3JlYXRlZF9ieVwiID0gXCJpbmZyYWhvdXNlL2F3cy1jb250cm9sLTI4OTI1NjEzODYyNFwiXG4gICAgICAgIH1cbiAgICB9XG5cbiAgIyBtb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0LXN0YXRlLW1hbmFnZXIuYXdzX2lhbV9yb2xlLnN0YXRlLW1hbmFnZXIgd2lsbCBiZSBjcmVhdGVkXG4gICsgcmVzb3VyY2UgXCJhd3NfaWFtX3JvbGVcIiBcInN0YXRlLW1hbmFnZXJcIiB7XG4gICAgICArIGFybiAgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgYXNzdW1lX3JvbGVfcG9saWN5ICAgID0ganNvbmVuY29kZShcbiAgICAgICAgICAgIHtcbiAgICAgICAgICAgICAgKyBTdGF0ZW1lbnQgPSBbXG4gICAgICAgICAgICAgICAgICArIHtcbiAgICAgICAgICAgICAgICAgICAgICArIEFjdGlvbiAgICA9IFwic3RzOkFzc3VtZVJvbGVcIlxuICAgICAgICAgICAgICAgICAgICAgICsgRWZmZWN0ICAgID0gXCJBbGxvd1wiXG4gICAgICAgICAgICAgICAgICAgICAgKyBQcmluY2lwYWwgPSB7XG4gICAgICAgICAgICAgICAgICAgICAgICAgICsgQVdTID0gW1xuICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgKyBcImFybjphd3M6aWFtOjo5OTA0NjY3NDgwNDU6dXNlci9hbGVrc1wiLFxuICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgKyBcImFybjphd3M6aWFtOjo0OTMzNzA4MjY0MjQ6cm9sZS9paC10Zi1hd3MtY29udHJvbC0zMDM0Njc2MDI4MDctZ2l0aHViXCIsXG4gICAgICAgICAgICAgICAgICAgICAgICAgICAgXVxuICAgICAgICAgICAgICAgICAgICAgICAgfVxuICAgICAgICAgICAgICAgICAgICAgICsgU2lkICAgICAgID0gXCIwMDBcIlxuICAgICAgICAgICAgICAgICAgICB9LFxuICAgICAgICAgICAgICAgIF1cbiAgICAgICAgICAgICAgKyBWZXJzaW9uICAgPSBcIjIwMTItMTAtMTdcIlxuICAgICAgICAgICAgfVxuICAgICAgICApXG4gICAgICArIGNyZWF0ZV9kYXRlICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgZGVzY3JpcHRpb24gICAgICAgICAgID0gXCJSb2xlIHRvIG1hbmFnZSBhIHRlcnJhZm9ybSBzdGF0ZSBvZiBhIHJlcG9cIlxuICAgICAgKyBmb3JjZV9kZXRhY2hfcG9saWNpZXMgPSBmYWxzZVxuICAgICAgKyBpZCAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIG1hbmFnZWRfcG9saWN5X2FybnMgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgbWF4X3Nlc3Npb25fZHVyYXRpb24gID0gMzYwMFxuICAgICAgKyBuYW1lICAgICAgICAgICAgICAgICAgPSBcImloLXRmLWF3cy1jb250cm9sLTQ5MzM3MDgyNjQyNC1zdGF0ZS1tYW5hZ2VyXCJcbiAgICAgICsgbmFtZV9wcmVmaXggICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBwYXRoICAgICAgICAgICAgICAgICAgPSBcIi9cIlxuICAgICAgKyByb2xlX2xhc3RfdXNlZCAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIHRhZ3NfYWxsICAgICAgICAgICAgICA9IHtcbiAgICAgICAgICArIFwiY3JlYXRlZF9ieVwiID0gXCJpbmZyYWhvdXNlL2F3cy1jb250cm9sLTI4OTI1NjEzODYyNFwiXG4gICAgICAgIH1cbiAgICAgICsgdW5pcXVlX2lkICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgIH1cblxuICAjIG1vZHVsZS5paC10Zi1hd3MtY29udHJvbC00OTMzNzA4MjY0MjQtc3RhdGUtbWFuYWdlci5hd3NfaWFtX3JvbGVfcG9saWN5X2F0dGFjaG1lbnQuc3RhdGUtbWFuYWdlciB3aWxsIGJlIGNyZWF0ZWRcbiAgKyByZXNvdXJjZSBcImF3c19pYW1fcm9sZV9wb2xpY3lfYXR0YWNobWVudFwiIFwic3RhdGUtbWFuYWdlclwiIHtcbiAgICAgICsgaWQgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgcG9saWN5X2FybiA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgcm9sZSAgICAgICA9IFwiaWgtdGYtYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0LXN0YXRlLW1hbmFnZXJcIlxuICAgIH1cblxuUGxhbjogNyB0byBhZGQsIDAgdG8gY2hhbmdlLCAwIHRvIGRlc3Ryb3kuXG5cblx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFxuXG5TYXZlZCB0aGUgcGxhbiB0bzogdGYucGxhblxuXG5UbyBwZXJmb3JtIGV4YWN0bHkgdGhlc2UgYWN0aW9ucywgcnVuIHRoZSBmb2xsb3dpbmcgY29tbWFuZCB0byBhcHBseTpcbiAgICB0ZXJyYWZvcm0gYXBwbHkgXCJ0Zi5wbGFuXCJcbjo6ZGVidWc6OlRlcnJhZm9ybSBleGl0ZWQgd2l0aCBjb2RlIDAuXG46OmRlYnVnOjpzdGRvdXQ6IG1vZHVsZS5idWNrZXRzW1wiaW5mcmFob3VzZS1hd3MtY29udHJvbC0zMDM0Njc2MDI4MDdcIl0uYXdzX3MzX2J1Y2tldC5zdGF0ZS1idWNrZXQ6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWluZnJhaG91c2UtYXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3XSUwQWF3c19keW5hbW9kYl90YWJsZS50ZXJyYWZvcm1fbG9ja3M6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWluZnJhaG91c2UtdGVycmFmb3JtLXN0YXRlLWxvY2tzXSUwQW1vZHVsZS5paC10Zi1hd3MtY29udHJvbC05OTA0NjY3NDgwNDUtc3RhdGUtbWFuYWdlci5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmFzc3VtZTogUmVhZGluZy4uLiUwQW1vZHVsZS5idWNrZXRzW1wiaW5mcmFob3VzZS1hd3MtY29udHJvbC05OTA0NjY3NDgwNDVcIl0uYXdzX3MzX2J1Y2tldC5zdGF0ZS1idWNrZXQ6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWluZnJhaG91c2UtYXdzLWNvbnRyb2wtOTkwNDY2NzQ4MDQ1XSUwQW1vZHVsZS5paC10Zi1hd3MtY29udHJvbC0zMDM0Njc2MDI4MDctc3RhdGUtbWFuYWdlci5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmFzc3VtZTogUmVhZGluZy4uLiUwQW1vZHVsZS5paC10Zi1hd3MtY29udHJvbC0yODkyNTYxMzg2MjQtYWRtaW4uZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5naXRodWItcGVybWlzc2lvbnM6IFJlYWRpbmcuLi4lMEFtb2R1bGUuZ2l0aHViLWNvbm5lY3Rvci5hd3NfaWFtX29wZW5pZF9jb25uZWN0X3Byb3ZpZGVyLmdpdGh1YjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXJuOmF3czppYW06OjI4OTI1NjEzODYyNDpvaWRjLXByb3ZpZGVyL3Rva2VuLmFjdGlvbnMuZ2l0aHVidXNlcmNvbnRlbnQuY29tXSUwQWRhdGEuYXdzX2lhbV9wb2xpY3kuYWRtaW5pc3RyYXRvci1hY2Nlc3M6IFJlYWRpbmcuLi4lMEFtb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtOTkwNDY2NzQ4MDQ1LXN0YXRlLW1hbmFnZXIuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5hc3N1bWU6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTI2NzAwOTk1MTZdJTBBbW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTI4OTI1NjEzODYyNC1hZG1pbi5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmdpdGh1Yi1wZXJtaXNzaW9uczogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9MTYwMzc3NDQ4NV0lMEFtb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3LXN0YXRlLW1hbmFnZXIuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5hc3N1bWU6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTQxNjM5MTkyMzddJTBBbW9kdWxlLmJ1Y2tldHNbXCJpbmZyYWhvdXNlLWdpdGh1Yi1zdGF0ZVwiXS5hd3NfczNfYnVja2V0LnN0YXRlLWJ1Y2tldDogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aW5mcmFob3VzZS1naXRodWItc3RhdGVdJTBBbW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTQ5MzM3MDgyNjQyNC1zdGF0ZS1tYW5hZ2VyLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuYXNzdW1lOiBSZWFkaW5nLi4uJTBBbW9kdWxlLmJ1Y2tldHNbXCJpbmZyYWhvdXNlLWF3cy1jb250cm9sLTI4OTI1NjEzODYyNFwiXS5hd3NfczNfYnVja2V0LnN0YXRlLWJ1Y2tldDogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aW5mcmFob3VzZS1hd3MtY29udHJvbC0yODkyNTYxMzg2MjRdJTBBbW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTQ5MzM3MDgyNjQyNC1zdGF0ZS1tYW5hZ2VyLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuYXNzdW1lOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD0zMDAyOTE3MTEzXSUwQW1vZHVsZS5paC10Zi1hd3MtY29udHJvbC0yODkyNTYxMzg2MjQtYWRtaW4uZGF0YS5hd3NfaWFtX3BvbGljeS5hZG1pbmlzdHJhdG9yLWFjY2VzczogUmVhZGluZy4uLiUwQW1vZHVsZS5paC10Zi1hd3MtY29udHJvbC05OTA0NjY3NDgwNDUtc3RhdGUtbWFuYWdlci5hd3NfaWFtX3JvbGUuc3RhdGUtbWFuYWdlcjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aWgtdGYtYXdzLWNvbnRyb2wtc3RhdGUtbWFuYWdlcl0lMEFtb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3LXN0YXRlLW1hbmFnZXIuYXdzX2lhbV9yb2xlLnN0YXRlLW1hbmFnZXI6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWloLXRmLWF3cy1jb250cm9sLTMwMzQ2NzYwMjgwNy1zdGF0ZS1tYW5hZ2VyXSUwQWRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuaWgtdGYtdGVycmFmb3JtLWNvbnRyb2wtYXNzdW1lOiBSZWFkaW5nLi4uJTBBZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5paC10Zi10ZXJyYWZvcm0tY29udHJvbC1hc3N1bWU6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTExNTQ5ODk5MzZdJTBBZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5paC10Zi1hd3MtY29udHJvbC1hc3N1bWU6IFJlYWRpbmcuLi4lMEFkYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmloLXRmLWF3cy1jb250cm9sLWFzc3VtZTogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9MTI2ODY3Mzg1Ml0lMEFkYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmloLXRmLWdpdGh1Yi1jb250cm9sLWFzc3VtZTogUmVhZGluZy4uLiUwQWRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuaWgtdGYtZ2l0aHViLWNvbnRyb2wtYXNzdW1lOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD0xNTIxMTI5NzM3XSUwQW1vZHVsZS5paC10Zi1hd3MtY29udHJvbC0yODkyNTYxMzg2MjQtc3RhdGUtbWFuYWdlci5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LnBlcm1pc3Npb25zOiBSZWFkaW5nLi4uJTBBbW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTI4OTI1NjEzODYyNC1zdGF0ZS1tYW5hZ2VyLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQucGVybWlzc2lvbnM6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTE4NzU1NjA5MzVdJTBBbW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTQ5MzM3MDgyNjQyNC1zdGF0ZS1tYW5hZ2VyLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQucGVybWlzc2lvbnM6IFJlYWRpbmcuLi4lMEFtb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0LXN0YXRlLW1hbmFnZXIuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5wZXJtaXNzaW9uczogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9Mzk4NjY1NDM4MF0lMEFtb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtOTkwNDY2NzQ4MDQ1LXN0YXRlLW1hbmFnZXIuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5wZXJtaXNzaW9uczogUmVhZGluZy4uLiUwQW1vZHVsZS5paC10Zi1hd3MtY29udHJvbC05OTA0NjY3NDgwNDUtc3RhdGUtbWFuYWdlci5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LnBlcm1pc3Npb25zOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD0yNzg3OTgyNTI1XSUwQW1vZHVsZS5paC10Zi1hd3MtY29udHJvbC0zMDM0Njc2MDI4MDctc3RhdGUtbWFuYWdlci5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LnBlcm1pc3Npb25zOiBSZWFkaW5nLi4uJTBBbW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTMwMzQ2NzYwMjgwNy1zdGF0ZS1tYW5hZ2VyLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQucGVybWlzc2lvbnM6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTMwNTYwMTk0NTZdJTBBYXdzX2lhbV9yb2xlLmloLXRmLXRlcnJhZm9ybS1jb250cm9sOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1paC10Zi10ZXJyYWZvcm0tY29udHJvbF0lMEFhd3NfaWFtX3JvbGUuaWgtdGYtYXdzLWNvbnRyb2w6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWloLXRmLWF3cy1jb250cm9sXSUwQWF3c19pYW1fcm9sZS5paC10Zi1naXRodWItY29udHJvbDogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aWgtdGYtZ2l0aHViLWNvbnRyb2xdJTBBbW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTI4OTI1NjEzODYyNC1zdGF0ZS1tYW5hZ2VyLmF3c19pYW1fcG9saWN5LnBlcm1pc3Npb25zOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hcm46YXdzOmlhbTo6Mjg5MjU2MTM4NjI0OnBvbGljeS9paC10Zi1hd3MtY29udHJvbC0yODkyNTYxMzg2MjQtc3RhdGUtbWFuYWdlcjIwMjMwNzAyMDEwOTUzODM0NDAwMDAwMDAxXSUwQW1vZHVsZS5paC10Zi1hd3MtY29udHJvbC05OTA0NjY3NDgwNDUtc3RhdGUtbWFuYWdlci5hd3NfaWFtX3BvbGljeS5wZXJtaXNzaW9uczogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXJuOmF3czppYW06OjI4OTI1NjEzODYyNDpwb2xpY3kvaWgtdGYtYXdzLWNvbnRyb2wtc3RhdGUtbWFuYWdlcjIwMjMwNzAzMDI1NzI4NjQ4NDAwMDAwMDAxXSUwQW1vZHVsZS5paC10Zi1hd3MtY29udHJvbC0zMDM0Njc2MDI4MDctc3RhdGUtbWFuYWdlci5hd3NfaWFtX3BvbGljeS5wZXJtaXNzaW9uczogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXJuOmF3czppYW06OjI4OTI1NjEzODYyNDpwb2xpY3kvaWgtdGYtYXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3LXN0YXRlLW1hbmFnZXIyMDIzMDcwMjE1NTAzNjgyNTUwMDAwMDAwMV0lMEFtb2R1bGUuYnVja2V0c1tcImluZnJhaG91c2UtZ2l0aHViLXN0YXRlXCJdLmF3c19zM19idWNrZXRfcHVibGljX2FjY2Vzc19ibG9jay5wdWJsaWNfYWNjZXNzOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pbmZyYWhvdXNlLWdpdGh1Yi1zdGF0ZV0lMEFtb2R1bGUuYnVja2V0c1tcImluZnJhaG91c2UtYXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3XCJdLmF3c19zM19idWNrZXRfcHVibGljX2FjY2Vzc19ibG9jay5wdWJsaWNfYWNjZXNzOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pbmZyYWhvdXNlLWF3cy1jb250cm9sLTMwMzQ2NzYwMjgwN10lMEFtb2R1bGUuYnVja2V0c1tcImluZnJhaG91c2UtYXdzLWNvbnRyb2wtMjg5MjU2MTM4NjI0XCJdLmF3c19zM19idWNrZXRfcHVibGljX2FjY2Vzc19ibG9jay5wdWJsaWNfYWNjZXNzOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pbmZyYWhvdXNlLWF3cy1jb250cm9sLTI4OTI1NjEzODYyNF0lMEFtb2R1bGUuYnVja2V0c1tcImluZnJhaG91c2UtYXdzLWNvbnRyb2wtOTkwNDY2NzQ4MDQ1XCJdLmF3c19zM19idWNrZXRfcHVibGljX2FjY2Vzc19ibG9jay5wdWJsaWNfYWNjZXNzOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pbmZyYWhvdXNlLWF3cy1jb250cm9sLTk5MDQ2Njc0ODA0NV0lMEFtb2R1bGUuYnVja2V0c1tcImluZnJhaG91c2UtZ2l0aHViLXN0YXRlXCJdLmF3c19zM19idWNrZXRfc2VydmVyX3NpZGVfZW5jcnlwdGlvbl9jb25maWd1cmF0aW9uLmRlZmF1bHQ6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWluZnJhaG91c2UtZ2l0aHViLXN0YXRlXSUwQW1vZHVsZS5paC10Zi1hd3MtY29udHJvbC0yODkyNTYxMzg2MjQtYWRtaW4uZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5naXRodWItYXNzdW1lOiBSZWFkaW5nLi4uJTBBbW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTI4OTI1NjEzODYyNC1hZG1pbi5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmdpdGh1Yi1hc3N1bWU6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTIwMjI4MzUxODZdJTBBbW9kdWxlLmJ1Y2tldHNbXCJpbmZyYWhvdXNlLWdpdGh1Yi1zdGF0ZVwiXS5hd3NfczNfYnVja2V0X3ZlcnNpb25pbmcuZW5hYmxlZDogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aW5mcmFob3VzZS1naXRodWItc3RhdGVdJTBBbW9kdWxlLmJ1Y2tldHNbXCJpbmZyYWhvdXNlLWF3cy1jb250cm9sLTMwMzQ2NzYwMjgwN1wiXS5hd3NfczNfYnVja2V0X3NlcnZlcl9zaWRlX2VuY3J5cHRpb25fY29uZmlndXJhdGlvbi5kZWZhdWx0OiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pbmZyYWhvdXNlLWF3cy1jb250cm9sLTMwMzQ2NzYwMjgwN10lMEFtb2R1bGUuYnVja2V0c1tcImluZnJhaG91c2UtYXdzLWNvbnRyb2wtMjg5MjU2MTM4NjI0XCJdLmF3c19zM19idWNrZXRfc2VydmVyX3NpZGVfZW5jcnlwdGlvbl9jb25maWd1cmF0aW9uLmRlZmF1bHQ6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWluZnJhaG91c2UtYXdzLWNvbnRyb2wtMjg5MjU2MTM4NjI0XSUwQW1vZHVsZS5idWNrZXRzW1wiaW5mcmFob3VzZS1hd3MtY29udHJvbC05OTA0NjY3NDgwNDVcIl0uYXdzX3MzX2J1Y2tldF9zZXJ2ZXJfc2lkZV9lbmNyeXB0aW9uX2NvbmZpZ3VyYXRpb24uZGVmYXVsdDogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aW5mcmFob3VzZS1hd3MtY29udHJvbC05OTA0NjY3NDgwNDVdJTBBbW9kdWxlLmJ1Y2tldHNbXCJpbmZyYWhvdXNlLWF3cy1jb250cm9sLTI4OTI1NjEzODYyNFwiXS5hd3NfczNfYnVja2V0X3ZlcnNpb25pbmcuZW5hYmxlZDogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aW5mcmFob3VzZS1hd3MtY29udHJvbC0yODkyNTYxMzg2MjRdJTBBbW9kdWxlLmJ1Y2tldHNbXCJpbmZyYWhvdXNlLWF3cy1jb250cm9sLTMwMzQ2NzYwMjgwN1wiXS5hd3NfczNfYnVja2V0X3ZlcnNpb25pbmcuZW5hYmxlZDogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aW5mcmFob3VzZS1hd3MtY29udHJvbC0zMDM0Njc2MDI4MDddJTBBbW9kdWxlLmJ1Y2tldHNbXCJpbmZyYWhvdXNlLWF3cy1jb250cm9sLTk5MDQ2Njc0ODA0NVwiXS5hd3NfczNfYnVja2V0X3ZlcnNpb25pbmcuZW5hYmxlZDogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aW5mcmFob3VzZS1hd3MtY29udHJvbC05OTA0NjY3NDgwNDVdJTBBbW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTI4OTI1NjEzODYyNC1hZG1pbi5hd3NfaWFtX3JvbGUuZ2l0aHViOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1paC10Zi1hd3MtY29udHJvbC0yODkyNTYxMzg2MjQtZ2l0aHViXSUwQW1vZHVsZS5paC10Zi1hd3MtY29udHJvbC05OTA0NjY3NDgwNDUtc3RhdGUtbWFuYWdlci5hd3NfaWFtX3JvbGVfcG9saWN5X2F0dGFjaG1lbnQuc3RhdGUtbWFuYWdlcjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aWgtdGYtYXdzLWNvbnRyb2wtc3RhdGUtbWFuYWdlci0yMDIzMDcwMzAyNTcyOTUyMDQwMDAwMDAwMl0lMEFtb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3LXN0YXRlLW1hbmFnZXIuYXdzX2lhbV9yb2xlX3BvbGljeV9hdHRhY2htZW50LnN0YXRlLW1hbmFnZXI6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWloLXRmLWF3cy1jb250cm9sLTMwMzQ2NzYwMjgwNy1zdGF0ZS1tYW5hZ2VyLTIwMjMwNzAyMTU1MDM3MDU0MzAwMDAwMDAyXSUwQW1vZHVsZS5paC10Zi1hd3MtY29udHJvbC0yODkyNTYxMzg2MjQtc3RhdGUtbWFuYWdlci5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmFzc3VtZTogUmVhZGluZy4uLiUwQW1vZHVsZS5paC10Zi1hd3MtY29udHJvbC0yODkyNTYxMzg2MjQtYWRtaW4uZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5hZG1pbi1hc3N1bWU6IFJlYWRpbmcuLi4lMEFtb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtMjg5MjU2MTM4NjI0LXN0YXRlLW1hbmFnZXIuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5hc3N1bWU6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTI3MDQ0MjM1MzddJTBBbW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTI4OTI1NjEzODYyNC1hZG1pbi5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmFkbWluLWFzc3VtZTogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9NDEzNjQ2OTA4XSUwQW1vZHVsZS5paC10Zi1hd3MtY29udHJvbC0yODkyNTYxMzg2MjQtc3RhdGUtbWFuYWdlci5hd3NfaWFtX3JvbGUuc3RhdGUtbWFuYWdlcjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aWgtdGYtYXdzLWNvbnRyb2wtMjg5MjU2MTM4NjI0LXN0YXRlLW1hbmFnZXJdJTBBbW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTI4OTI1NjEzODYyNC1hZG1pbi5hd3NfaWFtX3JvbGUuYWRtaW46IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWloLXRmLWF3cy1jb250cm9sLTI4OTI1NjEzODYyNC1hZG1pbl0lMEFtb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtMjg5MjU2MTM4NjI0LXN0YXRlLW1hbmFnZXIuYXdzX2lhbV9yb2xlX3BvbGljeV9hdHRhY2htZW50LnN0YXRlLW1hbmFnZXI6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWloLXRmLWF3cy1jb250cm9sLTI4OTI1NjEzODYyNC1zdGF0ZS1tYW5hZ2VyLTIwMjMwNzAyMDEwOTU0MzU4ODAwMDAwMDAyXSUwQWRhdGEuYXdzX2lhbV9wb2xpY3kuYWRtaW5pc3RyYXRvci1hY2Nlc3M6IFJlYWQgY29tcGxldGUgYWZ0ZXIgM3MgW2lkPWFybjphd3M6aWFtOjphd3M6cG9saWN5L0FkbWluaXN0cmF0b3JBY2Nlc3NdJTBBYXdzX2lhbV9yb2xlX3BvbGljeV9hdHRhY2htZW50LmloLXRmLWF3cy1jb250cm9sOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1paC10Zi1hd3MtY29udHJvbC0yMDIzMDYzMDAwMzUzMDUzMDkwMDAwMDAwMV0lMEFhd3NfaWFtX3JvbGVfcG9saWN5X2F0dGFjaG1lbnQuaWgtdGYtZ2l0aHViLWNvbnRyb2w6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWloLXRmLWdpdGh1Yi1jb250cm9sLTIwMjMwNjI3MTcyNzM0MzcwNDAwMDAwMDAyXSUwQWF3c19pYW1fcm9sZV9wb2xpY3lfYXR0YWNobWVudC5paC10Zi10ZXJyYWZvcm0tY29udHJvbDogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aWgtdGYtdGVycmFmb3JtLWNvbnRyb2wtMjAyMzA2MjcxNzI3MzM5MzEyMDAwMDAwMDFdJTBBbW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTI4OTI1NjEzODYyNC1hZG1pbi5kYXRhLmF3c19pYW1fcG9saWN5LmFkbWluaXN0cmF0b3ItYWNjZXNzOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDNzIFtpZD1hcm46YXdzOmlhbTo6YXdzOnBvbGljeS9BZG1pbmlzdHJhdG9yQWNjZXNzXSUwQW1vZHVsZS5paC10Zi1hd3MtY29udHJvbC0yODkyNTYxMzg2MjQtYWRtaW4uYXdzX2lhbV9yb2xlX3BvbGljeV9hdHRhY2htZW50LmFkbWluOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1paC10Zi1hd3MtY29udHJvbC0yODkyNTYxMzg2MjQtYWRtaW4tMjAyMzA3MDIwMTUyNDAxODY1MDAwMDAwMDFdJTBBJTBBVGVycmFmb3JtIHVzZWQgdGhlIHNlbGVjdGVkIHByb3ZpZGVycyB0byBnZW5lcmF0ZSB0aGUgZm9sbG93aW5nIGV4ZWN1dGlvbiUwQXBsYW4uIFJlc291cmNlIGFjdGlvbnMgYXJlIGluZGljYXRlZCB3aXRoIHRoZSBmb2xsb3dpbmcgc3ltYm9sczolMEEgICsgY3JlYXRlJTBBJTBBVGVycmFmb3JtIHdpbGwgcGVyZm9ybSB0aGUgZm9sbG93aW5nIGFjdGlvbnM6JTBBJTBBICAjIG1vZHVsZS5idWNrZXRzW1wiaW5mcmFob3VzZS1hd3MtY29udHJvbC00OTMzNzA4MjY0MjRcIl0uYXdzX3MzX2J1Y2tldC5zdGF0ZS1idWNrZXQgd2lsbCBiZSBjcmVhdGVkJTBBICArIHJlc291cmNlIFwiYXdzX3MzX2J1Y2tldFwiIFwic3RhdGUtYnVja2V0XCIgeyUwQSAgICAgICsgYWNjZWxlcmF0aW9uX3N0YXR1cyAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgYWNsICAgICAgICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgYXJuICAgICAgICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgYnVja2V0ICAgICAgICAgICAgICAgICAgICAgID0gXCJpbmZyYWhvdXNlLWF3cy1jb250cm9sLTQ5MzM3MDgyNjQyNFwiJTBBICAgICAgKyBidWNrZXRfZG9tYWluX25hbWUgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBidWNrZXRfcHJlZml4ICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBidWNrZXRfcmVnaW9uYWxfZG9tYWluX25hbWUgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBmb3JjZV9kZXN0cm95ICAgICAgICAgICAgICAgPSBmYWxzZSUwQSAgICAgICsgaG9zdGVkX3pvbmVfaWQgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgaWQgICAgICAgICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgb2JqZWN0X2xvY2tfZW5hYmxlZCAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgcG9saWN5ICAgICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgcmVnaW9uICAgICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgcmVxdWVzdF9wYXllciAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgdGFncyAgICAgICAgICAgICAgICAgICAgICAgID0geyUwQSAgICAgICAgICArIFwiZGVzY3JpcHRpb25cIiA9IFwiVGVycmFmb3JtIHN0YXRlIGZvciBjaS1jZCBhY2NvdW50IGh0dHBzOi8vZ2l0aHViLmNvbS9pbmZyYWhvdXNlL2F3cy1jb250cm9sLTQ5MzM3MDgyNjQyNFwiJTBBICAgICAgICB9JTBBICAgICAgKyB0YWdzX2FsbCAgICAgICAgICAgICAgICAgICAgPSB7JTBBICAgICAgICAgICsgXCJjcmVhdGVkX2J5XCIgID0gXCJpbmZyYWhvdXNlL2F3cy1jb250cm9sLTI4OTI1NjEzODYyNFwiJTBBICAgICAgICAgICsgXCJkZXNjcmlwdGlvblwiID0gXCJUZXJyYWZvcm0gc3RhdGUgZm9yIGNpLWNkIGFjY291bnQgaHR0cHM6Ly9naXRodWIuY29tL2luZnJhaG91c2UvYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0XCIlMEEgICAgICAgIH0lMEEgICAgICArIHdlYnNpdGVfZG9tYWluICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIHdlYnNpdGVfZW5kcG9pbnQgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgfSUwQSUwQSAgIyBtb2R1bGUuYnVja2V0c1tcImluZnJhaG91c2UtYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0XCJdLmF3c19zM19idWNrZXRfcHVibGljX2FjY2Vzc19ibG9jay5wdWJsaWNfYWNjZXNzIHdpbGwgYmUgY3JlYXRlZCUwQSAgKyByZXNvdXJjZSBcImF3c19zM19idWNrZXRfcHVibGljX2FjY2Vzc19ibG9ja1wiIFwicHVibGljX2FjY2Vzc1wiIHslMEEgICAgICArIGJsb2NrX3B1YmxpY19hY2xzICAgICAgID0gdHJ1ZSUwQSAgICAgICsgYmxvY2tfcHVibGljX3BvbGljeSAgICAgPSB0cnVlJTBBICAgICAgKyBidWNrZXQgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIGlkICAgICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgaWdub3JlX3B1YmxpY19hY2xzICAgICAgPSB0cnVlJTBBICAgICAgKyByZXN0cmljdF9wdWJsaWNfYnVja2V0cyA9IHRydWUlMEEgICAgfSUwQSUwQSAgIyBtb2R1bGUuYnVja2V0c1tcImluZnJhaG91c2UtYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0XCJdLmF3c19zM19idWNrZXRfc2VydmVyX3NpZGVfZW5jcnlwdGlvbl9jb25maWd1cmF0aW9uLmRlZmF1bHQgd2lsbCBiZSBjcmVhdGVkJTBBICArIHJlc291cmNlIFwiYXdzX3MzX2J1Y2tldF9zZXJ2ZXJfc2lkZV9lbmNyeXB0aW9uX2NvbmZpZ3VyYXRpb25cIiBcImRlZmF1bHRcIiB7JTBBICAgICAgKyBidWNrZXQgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBpZCAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBJTBBICAgICAgKyBydWxlIHslMEEgICAgICAgICAgKyBhcHBseV9zZXJ2ZXJfc2lkZV9lbmNyeXB0aW9uX2J5X2RlZmF1bHQgeyUwQSAgICAgICAgICAgICAgKyBzc2VfYWxnb3JpdGhtID0gXCJBRVMyNTZcIiUwQSAgICAgICAgICAgIH0lMEEgICAgICAgIH0lMEEgICAgfSUwQSUwQSAgIyBtb2R1bGUuYnVja2V0c1tcImluZnJhaG91c2UtYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0XCJdLmF3c19zM19idWNrZXRfdmVyc2lvbmluZy5lbmFibGVkIHdpbGwgYmUgY3JlYXRlZCUwQSAgKyByZXNvdXJjZSBcImF3c19zM19idWNrZXRfdmVyc2lvbmluZ1wiIFwiZW5hYmxlZFwiIHslMEEgICAgICArIGJ1Y2tldCA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIGlkICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEElMEEgICAgICArIHZlcnNpb25pbmdfY29uZmlndXJhdGlvbiB7JTBBICAgICAgICAgICsgbWZhX2RlbGV0ZSA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICAgICAgKyBzdGF0dXMgICAgID0gXCJFbmFibGVkXCIlMEEgICAgICAgIH0lMEEgICAgfSUwQSUwQSAgIyBtb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0LXN0YXRlLW1hbmFnZXIuYXdzX2lhbV9wb2xpY3kucGVybWlzc2lvbnMgd2lsbCBiZSBjcmVhdGVkJTBBICArIHJlc291cmNlIFwiYXdzX2lhbV9wb2xpY3lcIiBcInBlcm1pc3Npb25zXCIgeyUwQSAgICAgICsgYXJuICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBpZCAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIG5hbWUgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgbmFtZV9wcmVmaXggPSBcImloLXRmLWF3cy1jb250cm9sLTQ5MzM3MDgyNjQyNC1zdGF0ZS1tYW5hZ2VyXCIlMEEgICAgICArIHBhdGggICAgICAgID0gXCIvXCIlMEEgICAgICArIHBvbGljeSAgICAgID0ganNvbmVuY29kZSglMEEgICAgICAgICAgICB7JTBBICAgICAgICAgICAgICArIFN0YXRlbWVudCA9IFslMEEgICAgICAgICAgICAgICAgICArIHslMEEgICAgICAgICAgICAgICAgICAgICAgKyBBY3Rpb24gICA9IFwiczM6TGlzdEJ1Y2tldFwiJTBBICAgICAgICAgICAgICAgICAgICAgICsgRWZmZWN0ICAgPSBcIkFsbG93XCIlMEEgICAgICAgICAgICAgICAgICAgICAgKyBSZXNvdXJjZSA9IFwiYXJuOmF3czpzMzo6OmluZnJhaG91c2UtYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0XCIlMEEgICAgICAgICAgICAgICAgICAgICAgKyBTaWQgICAgICA9IFwiXCIlMEEgICAgICAgICAgICAgICAgICAgIH0sJTBBICAgICAgICAgICAgICAgICAgKyB7JTBBICAgICAgICAgICAgICAgICAgICAgICsgQWN0aW9uICAgPSBbJTBBICAgICAgICAgICAgICAgICAgICAgICAgICArIFwiczM6UHV0T2JqZWN0XCIsJTBBICAgICAgICAgICAgICAgICAgICAgICAgICArIFwiczM6R2V0T2JqZWN0XCIsJTBBICAgICAgICAgICAgICAgICAgICAgICAgICArIFwiczM6RGVsZXRlT2JqZWN0XCIsJTBBICAgICAgICAgICAgICAgICAgICAgICAgXSUwQSAgICAgICAgICAgICAgICAgICAgICArIEVmZmVjdCAgID0gXCJBbGxvd1wiJTBBICAgICAgICAgICAgICAgICAgICAgICsgUmVzb3VyY2UgPSBbJTBBICAgICAgICAgICAgICAgICAgICAgICAgICArIFwiYXJuOmF3czpzMzo6OmluZnJhaG91c2UtYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0L3RlcnJhZm9ybS50ZnN0YXRlXCIsJTBBICAgICAgICAgICAgICAgICAgICAgICAgICArIFwiYXJuOmF3czpzMzo6OmluZnJhaG91c2UtYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0L3BsYW5zLypcIiwlMEEgICAgICAgICAgICAgICAgICAgICAgICBdJTBBICAgICAgICAgICAgICAgICAgICAgICsgU2lkICAgICAgPSBcIlwiJTBBICAgICAgICAgICAgICAgICAgICB9LCUwQSAgICAgICAgICAgICAgICAgICsgeyUwQSAgICAgICAgICAgICAgICAgICAgICArIEFjdGlvbiAgID0gWyUwQSAgICAgICAgICAgICAgICAgICAgICAgICAgKyBcImR5bmFtb2RiOlB1dEl0ZW1cIiwlMEEgICAgICAgICAgICAgICAgICAgICAgICAgICsgXCJkeW5hbW9kYjpHZXRJdGVtXCIsJTBBICAgICAgICAgICAgICAgICAgICAgICAgICArIFwiZHluYW1vZGI6RGVzY3JpYmVUYWJsZVwiLCUwQSAgICAgICAgICAgICAgICAgICAgICAgICAgKyBcImR5bmFtb2RiOkRlbGV0ZUl0ZW1cIiwlMEEgICAgICAgICAgICAgICAgICAgICAgICBdJTBBICAgICAgICAgICAgICAgICAgICAgICsgRWZmZWN0ICAgPSBcIkFsbG93XCIlMEEgICAgICAgICAgICAgICAgICAgICAgKyBSZXNvdXJjZSA9IFwiYXJuOmF3czpkeW5hbW9kYjp1cy13ZXN0LTE6Mjg5MjU2MTM4NjI0OnRhYmxlL2luZnJhaG91c2UtdGVycmFmb3JtLXN0YXRlLWxvY2tzXCIlMEEgICAgICAgICAgICAgICAgICAgICAgKyBTaWQgICAgICA9IFwiXCIlMEEgICAgICAgICAgICAgICAgICAgIH0sJTBBICAgICAgICAgICAgICAgIF0lMEEgICAgICAgICAgICAgICsgVmVyc2lvbiAgID0gXCIyMDEyLTEwLTE3XCIlMEEgICAgICAgICAgICB9JTBBICAgICAgICApJTBBICAgICAgKyBwb2xpY3lfaWQgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIHRhZ3NfYWxsICAgID0geyUwQSAgICAgICAgICArIFwiY3JlYXRlZF9ieVwiID0gXCJpbmZyYWhvdXNlL2F3cy1jb250cm9sLTI4OTI1NjEzODYyNFwiJTBBICAgICAgICB9JTBBICAgIH0lMEElMEEgICMgbW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTQ5MzM3MDgyNjQyNC1zdGF0ZS1tYW5hZ2VyLmF3c19pYW1fcm9sZS5zdGF0ZS1tYW5hZ2VyIHdpbGwgYmUgY3JlYXRlZCUwQSAgKyByZXNvdXJjZSBcImF3c19pYW1fcm9sZVwiIFwic3RhdGUtbWFuYWdlclwiIHslMEEgICAgICArIGFybiAgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIGFzc3VtZV9yb2xlX3BvbGljeSAgICA9IGpzb25lbmNvZGUoJTBBICAgICAgICAgICAgeyUwQSAgICAgICAgICAgICAgKyBTdGF0ZW1lbnQgPSBbJTBBICAgICAgICAgICAgICAgICAgKyB7JTBBICAgICAgICAgICAgICAgICAgICAgICsgQWN0aW9uICAgID0gXCJzdHM6QXNzdW1lUm9sZVwiJTBBICAgICAgICAgICAgICAgICAgICAgICsgRWZmZWN0ICAgID0gXCJBbGxvd1wiJTBBICAgICAgICAgICAgICAgICAgICAgICsgUHJpbmNpcGFsID0geyUwQSAgICAgICAgICAgICAgICAgICAgICAgICAgKyBBV1MgPSBbJTBBICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgKyBcImFybjphd3M6aWFtOjo5OTA0NjY3NDgwNDU6dXNlci9hbGVrc1wiLCUwQSAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICsgXCJhcm46YXdzOmlhbTo6NDkzMzcwODI2NDI0OnJvbGUvaWgtdGYtYXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3LWdpdGh1YlwiLCUwQSAgICAgICAgICAgICAgICAgICAgICAgICAgICBdJTBBICAgICAgICAgICAgICAgICAgICAgICAgfSUwQSAgICAgICAgICAgICAgICAgICAgICArIFNpZCAgICAgICA9IFwiMDAwXCIlMEEgICAgICAgICAgICAgICAgICAgIH0sJTBBICAgICAgICAgICAgICAgIF0lMEEgICAgICAgICAgICAgICsgVmVyc2lvbiAgID0gXCIyMDEyLTEwLTE3XCIlMEEgICAgICAgICAgICB9JTBBICAgICAgICApJTBBICAgICAgKyBjcmVhdGVfZGF0ZSAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBkZXNjcmlwdGlvbiAgICAgICAgICAgPSBcIlJvbGUgdG8gbWFuYWdlIGEgdGVycmFmb3JtIHN0YXRlIG9mIGEgcmVwb1wiJTBBICAgICAgKyBmb3JjZV9kZXRhY2hfcG9saWNpZXMgPSBmYWxzZSUwQSAgICAgICsgaWQgICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgbWFuYWdlZF9wb2xpY3lfYXJucyAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgbWF4X3Nlc3Npb25fZHVyYXRpb24gID0gMzYwMCUwQSAgICAgICsgbmFtZSAgICAgICAgICAgICAgICAgID0gXCJpaC10Zi1hd3MtY29udHJvbC00OTMzNzA4MjY0MjQtc3RhdGUtbWFuYWdlclwiJTBBICAgICAgKyBuYW1lX3ByZWZpeCAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBwYXRoICAgICAgICAgICAgICAgICAgPSBcIi9cIiUwQSAgICAgICsgcm9sZV9sYXN0X3VzZWQgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgdGFnc19hbGwgICAgICAgICAgICAgID0geyUwQSAgICAgICAgICArIFwiY3JlYXRlZF9ieVwiID0gXCJpbmZyYWhvdXNlL2F3cy1jb250cm9sLTI4OTI1NjEzODYyNFwiJTBBICAgICAgICB9JTBBICAgICAgKyB1bmlxdWVfaWQgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgIH0lMEElMEEgICMgbW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTQ5MzM3MDgyNjQyNC1zdGF0ZS1tYW5hZ2VyLmF3c19pYW1fcm9sZV9wb2xpY3lfYXR0YWNobWVudC5zdGF0ZS1tYW5hZ2VyIHdpbGwgYmUgY3JlYXRlZCUwQSAgKyByZXNvdXJjZSBcImF3c19pYW1fcm9sZV9wb2xpY3lfYXR0YWNobWVudFwiIFwic3RhdGUtbWFuYWdlclwiIHslMEEgICAgICArIGlkICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBwb2xpY3lfYXJuID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgcm9sZSAgICAgICA9IFwiaWgtdGYtYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0LXN0YXRlLW1hbmFnZXJcIiUwQSAgICB9JTBBJTBBUGxhbjogNyB0byBhZGQsIDAgdG8gY2hhbmdlLCAwIHRvIGRlc3Ryb3kuJTBBJTBBXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwJTBBJTBBU2F2ZWQgdGhlIHBsYW4gdG86IHRmLnBsYW4lMEElMEFUbyBwZXJmb3JtIGV4YWN0bHkgdGhlc2UgYWN0aW9ucywgcnVuIHRoZSBmb2xsb3dpbmcgY29tbWFuZCB0byBhcHBseTolMEEgICAgdGVycmFmb3JtIGFwcGx5IFwidGYucGxhblwiJTBBXG46OmRlYnVnOjpzdGRlcnI6IFxuOjpkZWJ1Zzo6ZXhpdGNvZGU6IDBcbiIsICJzdGRlcnIiOiAiIiwgImFkZCI6IDcsICJjaGFuZ2UiOiAwLCAiZGVzdHJveSI6IDB9fQ==```
</p></details>